import type { VehicleType } from "@car/shared-types";

export type VehicleBrandCatalogItem = {
  id: string;
  name: string;
  aliases?: string[];
  models: string[];
};

export type VehicleModelSuggestion = {
  brandId: string;
  brandName: string;
  modelName: string;
  value: string;
};

const carCatalog: VehicleBrandCatalogItem[] = [
  {
    "id": "car-1",
    "name": "大众",
    "models": [
      "与众06",
      "与众09",
      "ID.EVO",
      "大众ID.GTI",
      "途锐",
      "大众e-up!",
      "大众Fox",
      "大众up!",
      "Ameo",
      "ID.POLO",
      "Polo(进口)",
      "Virtus",
      "大众ID.2",
      "高尔(海外)",
      "Jetta",
      "大众PRID.3",
      "高尔夫(进口)",
      "Passat",
      "大众ID.X",
      "ID.CODE",
      "ID.Cross",
      "Nivus",
      "Taigo",
      "Taigun",
      "Tera",
      "Taos",
      "Tiguan",
      "大众ID.5",
      "探岳(海外)",
      "大众Atlas",
      "ID. Buzz",
      "开迪(海外)",
      "途安(海外)",
      "迈特威",
      "迈特威新能源",
      "凯路威",
      "Crafter",
      "Amarok",
      "Saveiro",
      "Nils",
      "大众XL1",
      "甲壳虫",
      "大众ID.",
      "Arteon",
      "大众CC",
      "迈腾(进口)",
      "蔚揽",
      "蔚揽新能源",
      "C Coupe",
      "辉腾",
      "Buggy Up",
      "T-Prime",
      "途锐新能源",
      "BUDD-e",
      "Bulli",
      "e-Bulli",
      "Milano",
      "Space Up",
      "夏朗",
      "Routan",
      "大众MOIA",
      "尚酷",
      "大众Eos",
      "大众ID. R",
      "大众XL",
      "Pickup",
      "Tarok",
      "Tristar",
      "Polo",
      "朗逸",
      "大众ID.3",
      "凌渡",
      "帕萨特",
      "ID.4 X",
      "途岳",
      "ID.6 X",
      "途昂",
      "途安",
      "威然",
      "帕萨特新能源",
      "途观L新能源",
      "大众ID.7 S",
      "高尔",
      "桑塔纳",
      "朗行",
      "朗境",
      "朗逸纯电",
      "Passat领驭",
      "桑塔纳经典",
      "桑塔纳志俊",
      "辉昂",
      "辉昂新能源",
      "途铠",
      "途观",
      "途岳新能源",
      "途观X",
      "宝来",
      "高尔夫",
      "高尔夫GTI",
      "一汽-大众CC",
      "T-ROC探歌",
      "探岳",
      "探岳X",
      "揽境",
      "ID.AURA",
      "ID. AERO",
      "捷达",
      "C-TREK蔚领",
      "宝来·纯电",
      "宝来经典",
      "高尔夫·纯电",
      "高尔夫·嘉旅",
      "探影",
      "开迪"
    ]
  },
  {
    "id": "car-2",
    "name": "丰田",
    "models": [
      "铂智4X",
      "雷凌",
      "铂智3X",
      "锋兰达",
      "威兰达",
      "威兰达新能源",
      "汉兰达",
      "威飒",
      "赛那SIENNA",
      "凌尚",
      "广汽丰田bZ4X",
      "雅力士",
      "雷凌双擎E+",
      "丰田C-HR",
      "逸致",
      "丰田FT-3e",
      "兰德酷路泽Se",
      "威尔法新能源",
      "IMV 0",
      "丰田FT-Se",
      "Rangga",
      "EPU",
      "Mirai",
      "皇冠(进口)",
      "埃尔法",
      "威尔法",
      "SUPRA",
      "Aygo",
      "丰田COMS",
      "丰田FT-Me",
      "Agya",
      "AQUA",
      "Starlet",
      "丰田SAI",
      "卡罗拉(进口)",
      "普锐斯(海外)",
      "JPN Taxi",
      "凯美瑞(海外)",
      "亚洲龙(海外)",
      "丰田世纪",
      "Aygo X",
      "RAIZE",
      "智享跨界",
      "Rush",
      "兰德酷路泽FJ",
      "悦动空间",
      "Fortuner",
      "丰田bZ(海外)",
      "汉兰达(进口)",
      "皇冠SPORT",
      "威飒(进口)",
      "4Runner",
      "皇冠Signia",
      "普拉多(进口)",
      "红杉",
      "Innova",
      "Probox",
      "Roomy",
      "Rumion",
      "SIENTA",
      "丰田Noah",
      "丰田Voxy",
      "Mid Box",
      "Gran Ace",
      "SIENNA",
      "埃尔法新能源",
      "La Coupe",
      "丰田GR GT",
      "HIACE",
      "Proace",
      "丰田APM",
      "Hilux",
      "Hilux新能源",
      "Tacoma",
      "坦途",
      "Fun-Vii",
      "i-Road",
      "i-TRIL",
      "KIKAI",
      "丰田e-4me",
      "丰田FT-CH",
      "丰田FT-EV",
      "丰田FT-HT",
      "丰田FV2",
      "丰田Hi-CT",
      "丰田iQ",
      "ME.WE",
      "RHOMBUS",
      "Spade",
      "丰田FT-Bh",
      "丰田RiN",
      "威驰(海外)",
      "悦佳",
      "Auris",
      "Matrix",
      "丰田1X",
      "丰田LQ",
      "丰田NS4",
      "Avensis",
      "Cressida",
      "丰巢FUN",
      "丰田FCV",
      "丰田FCV-R",
      "锐志(海外)",
      "Celsior",
      "ViRA",
      "丰巢WAY",
      "丰田FT-4X",
      "丰田FT-AC",
      "FJ 酷路泽",
      "Verso",
      "Verso-S",
      "WISH",
      "丰田e-Care",
      "普瑞维亚",
      "Celica",
      "Setsuna",
      "丰田86",
      "丰田FT-1",
      "丰田FT-86",
      "丰田S-FR",
      "杰路驰",
      "柯斯达(海外)",
      "A-BAT",
      "卡罗拉",
      "丰田bZ3",
      "RAV4荣放",
      "卡罗拉锐放",
      "丰田bZ5",
      "皇冠陆放",
      "普拉多",
      "格瑞维亚",
      "柯斯达",
      "柯斯达氢擎",
      "威驰",
      "威驰FS",
      "花冠",
      "卡罗拉双擎E+",
      "普锐斯",
      "亚洲狮",
      "锐志",
      "皇冠",
      "特锐",
      "奕泽E进擎",
      "奕泽IZOA",
      "一汽丰田bZ4X",
      "兰德酷路泽"
    ]
  },
  {
    "id": "car-3",
    "name": "本田",
    "models": [
      "LIFE",
      "英仕派",
      "英仕派新能源",
      "本田e:NS1",
      "本田XR-V",
      "本田CR-V",
      "本田HR-V",
      "猎光e:NS2",
      "本田UR-V",
      "东风本田S7",
      "艾力绅",
      "东风本田GT",
      "杰德",
      "本田S",
      "哥瑞",
      "竞瑞",
      "享域",
      "思铂睿",
      "飞度",
      "型格",
      "雅阁",
      "雅阁新能源",
      "缤智",
      "皓影",
      "皓影新能源",
      "冠道",
      "广汽本田P7",
      "奥德赛",
      "广汽本田GT",
      "锋范经典",
      "思迪",
      "锋范",
      "凌派",
      "本田C",
      "歌诗图",
      "ZR-V 致在",
      "本田CI-MEV",
      "思域(进口)",
      "Brio",
      "N ONE",
      "N-BOX",
      "本田e",
      "N-WGN",
      "Shuttle",
      "本田Amaze",
      "飞度(进口)",
      "锋范(海外)",
      "INSIGHT",
      "本田e:N GT",
      "本田e:N2",
      "雅阁(海外)",
      "里程",
      "本田e:Ny1",
      "Prelude",
      "本田SUV RS",
      "本田WR-V",
      "缤智(海外)",
      "本田BR-V",
      "本田N7X",
      "Passport",
      "Pilot",
      "本田0 SUV",
      "Freed",
      "STEP WGN",
      "奥德赛(进口)",
      "本田NSX",
      "本田S660",
      "Gear",
      "P-NUT",
      "NeuV",
      "Small RS",
      "Step Bus",
      "本田FCV",
      "杰德(海外)",
      "CLARITY",
      "本田AC-X",
      "本田FCX",
      "歌诗图(海外)",
      "本田Urban",
      "元素",
      "时韵",
      "EV-Ster",
      "本田CR-Z",
      "本田S2000",
      "Tomo",
      "本田SUT"
    ]
  },
  {
    "id": "car-4",
    "name": "日产",
    "models": [
      "探陆",
      "骐达TIIDA",
      "轩逸",
      "天籁",
      "劲客",
      "逍客",
      "奇骏",
      "ARIYA艾睿雅",
      "玛驰",
      "骊威",
      "阳光",
      "蓝鸟",
      "轩逸·纯电",
      "颐达",
      "蓝鸟经典",
      "西玛",
      "楼兰",
      "骏逸",
      "Sakura",
      "DAYZ",
      "Note",
      "玛驰(海外)",
      "日产IMk",
      "Sentra",
      "聆风",
      "阳光(海外)",
      "Altima",
      "Epoch",
      "Evo",
      "Skyline",
      "西玛(海外)",
      "JUKE",
      "JUKE新能源",
      "劲客(海外)",
      "Epic",
      "Rogue",
      "奇骏(进口)",
      "逍客(进口)",
      "Era",
      "Terra",
      "楼兰(海外)",
      "Arizon",
      "探陆(海外)",
      "途乐",
      "Livina",
      "日产NV250",
      "Serena",
      "日产NV350",
      "Elgrand",
      "日产NV300",
      "日产NV3500",
      "Fairlady",
      "日产370Z",
      "日产GT-R",
      "日产Z",
      "日产Roox",
      "Titan",
      "纳瓦拉(海外)",
      "Pivo 3",
      "Pixo",
      "Townpod",
      "Cube",
      "Sway",
      "Ellure",
      "Pulsar",
      "蓝鸟·印象",
      "日产IDS",
      "风度",
      "日产IMx",
      "风雅",
      "日产IMs",
      "Cedric",
      "CIMA",
      "Extrem",
      "日产IMQ",
      "Hi-Cross",
      "Xterra",
      "Xmotion",
      "贵士",
      "Esflow",
      "Gripz",
      "Silvia",
      "日产350Z",
      "日产IDX",
      "碧莲",
      "纳瓦拉",
      "日产帕拉丁",
      "途达",
      "日产NV200",
      "日产D22",
      "日产ZN厢式车"
    ]
  },
  {
    "id": "car-5",
    "name": "别克",
    "models": [
      "威朗",
      "微蓝6",
      "君威",
      "君越",
      "别克至境L7",
      "昂科威Plus",
      "昂科威S",
      "别克E5",
      "别克GL8",
      "别克至境世家",
      "Electra",
      "至境SUV",
      "VELITE 5",
      "凯越",
      "英朗",
      "阅朗",
      "新世纪",
      "林荫大道",
      "荣御",
      "昂科拉",
      "微蓝7",
      "昂科拉GX",
      "昂科拉PLUS",
      "昂扬",
      "Enspire",
      "昂科旗",
      "奥特能电动车",
      "别克E4",
      "别克GL6",
      "别克Orbit",
      "昂科威(海外)",
      "昂科雷",
      "君威(海外)",
      "君越(海外)",
      "Avenir",
      "Special",
      "昂科拉(海外)",
      "Anthem",
      "Business",
      "Avista",
      "Riviera"
    ]
  },
  {
    "id": "car-6",
    "name": "雪佛兰",
    "models": [
      "探界者Plus",
      "畅巡",
      "科鲁泽",
      "迈锐宝XL",
      "创酷",
      "星迈罗",
      "探界者",
      "开拓者",
      "探界者新能源",
      "赛欧",
      "爱唯欧",
      "乐骋",
      "乐风",
      "乐风RV",
      "科鲁兹",
      "科沃兹",
      "沃兰多",
      "景程",
      "迈锐宝",
      "创界",
      "科帕奇",
      "斯帕可",
      "Bolt EV",
      "科鲁泽(海外)",
      "科沃兹(海外)",
      "迈锐宝(海外)",
      "Bolt EUV",
      "Groove",
      "创酷(海外)",
      "科帕奇(进口)",
      "探界者(海外)",
      "开拓者(海外)",
      "雪佛兰Beast",
      "Suburban",
      "Spin",
      "Express",
      "科迈罗",
      "Montana",
      "库罗德",
      "索罗德",
      "索罗德新能源",
      "雪佛兰EN-V",
      "Essentia",
      "Sonic",
      "爱唯欧(海外)",
      "Agile",
      "Cobalt",
      "科鲁兹(海外)",
      "沃蓝达",
      "Impala",
      "Caprice",
      "雪佛兰SS",
      "Adra",
      "雪佛兰Niva",
      "雪佛兰FNR-X",
      "Orlando",
      "Code",
      "Miray",
      "雪佛兰FNR",
      "雪佛兰Tru"
    ]
  },
  {
    "id": "car-7",
    "name": "福特",
    "models": [
      "福特烈马",
      "领睿",
      "领睿新能源",
      "福特智趣烈马",
      "领裕",
      "领裕新能源",
      "途睿欧",
      "E全顺",
      "全顺",
      "新世代全顺",
      "领界",
      "领界EV",
      "撼路者",
      "经典全顺",
      "Mustang",
      "Figo",
      "福特Ka",
      "嘉年华(进口)",
      "福克斯(进口)",
      "Fusion",
      "金牛座(海外)",
      "蒙迪欧(海外)",
      "PUMA",
      "PUMA新能源",
      "翼搏(海外)",
      "Capri",
      "领界(海外)",
      "锐际(进口)",
      "探险者EV",
      "福特电马(海外)",
      "撼路者(海外)",
      "锐界(进口)",
      "探险者(进口)",
      "探险者新能源",
      "Galaxy",
      "S-MAX",
      "全顺(海外)",
      "福特GT",
      "Maverick",
      "福特F-250",
      "福特F-350",
      "福特F-450",
      "Start",
      "福特莱利",
      "福睿斯(海外)",
      "Falcon",
      "福特GPW",
      "Vertrek",
      "FLEX",
      "B-MAX",
      "C-MAX",
      "福特E350",
      "福特E系列",
      "Evos(海外)",
      "Formula",
      "Mad Max",
      "福特4-Trac",
      "福特Atlas",
      "福特F-650",
      "蒙迪欧",
      "锐际",
      "锐际新能源",
      "EVOS",
      "福特电马",
      "锐界",
      "探险者",
      "嘉年华",
      "福克斯",
      "福睿斯",
      "金牛座",
      "蒙迪欧新能源",
      "蒙迪欧-致胜",
      "致胜",
      "翼搏",
      "翼虎",
      "麦柯斯"
    ]
  },
  {
    "id": "car-8",
    "name": "现代",
    "models": [
      "EXTER",
      "Nexo",
      "帕里斯帝",
      "现代i10",
      "现代HB20",
      "现代i20",
      "雅绅特(海外)",
      "现代RM19",
      "伊兰特(进口)",
      "Prophecy",
      "索纳塔(进口)",
      "现代i40",
      "雅尊",
      "BAYON",
      "Creta",
      "INSTER",
      "KONA",
      "KONA新能源",
      "Venue",
      "现代AX1",
      "现代CASPER",
      "Alcazar",
      "HDC-7",
      "Vision T",
      "途胜(进口)",
      "胜达(进口)",
      "现代Earth",
      "Boulder",
      "现代SEVEN",
      "STARIA",
      "现代H350",
      "现代i10新能源",
      "Getz",
      "Xcent",
      "瑞纳(海外)",
      "现代ix20",
      "现代RB",
      "现代Saga",
      "Aslan",
      "Avante",
      "现代RN30",
      "Blue2",
      "君爵",
      "捷恩斯",
      "劳恩斯",
      "现代AG",
      "雅科仕",
      "Curb",
      "Enduro",
      "Intrado",
      "Nuvis",
      "圣达菲(进口)",
      "格越",
      "胜达经典",
      "维拉克斯",
      "美佳",
      "H-1辉翼",
      "iMax",
      "i-flow",
      "KITE",
      "Vision G",
      "酷派",
      "劳恩斯-酷派",
      "现代HND-9",
      "现代RM16",
      "KONA N",
      "现代RN22e",
      "菲斯塔",
      "伊兰特",
      "索纳塔",
      "途胜",
      "北京现代ix35",
      "EO 羿欧",
      "胜达",
      "库斯途",
      "名图新能源",
      "瑞纳",
      "瑞奕",
      "雅绅特",
      "悦纳",
      "悦纳RV",
      "悦动",
      "朗动",
      "CELESTA",
      "北京现代i30",
      "菲斯塔纯电动",
      "领动",
      "领动插电混动",
      "伊兰特EV",
      "逸行",
      "领翔",
      "名图",
      "名驭",
      "索纳塔插电混动",
      "御翔",
      "昂希诺纯电动",
      "北京现代ix25",
      "康恩迪"
    ]
  },
  {
    "id": "car-9",
    "name": "起亚",
    "models": [
      "索奈",
      "起亚EV5",
      "焕驰",
      "起亚K3",
      "起亚K5",
      "奕跑",
      "赛图斯",
      "狮铂拓界",
      "智跑",
      "嘉华",
      "KX CROSS",
      "起亚K2",
      "千里马",
      "锐欧",
      "秀尔",
      "赛拉图",
      "福瑞迪",
      "起亚K3S",
      "起亚K3新能源",
      "凯绅",
      "起亚K4",
      "起亚K5新能源",
      "远舰",
      "KX3傲跑",
      "起亚KX3新能源",
      "起亚KX5",
      "狮跑",
      "起亚KX7",
      "起亚EV3",
      "起亚EV4",
      "起亚EV6",
      "Picanto",
      "起亚Ray",
      "Soul",
      "Soul新能源",
      "焕驰(海外)",
      "起亚Ray EV",
      "锐欧(海外)",
      "Forte",
      "ProCeed",
      "起亚Ceed",
      "起亚K3(海外)",
      "起亚K4(海外)",
      "起亚XCeed",
      "起亚K5(进口)",
      "凯尊",
      "起亚K7",
      "起亚K8",
      "起亚K9",
      "起亚K900",
      "斯汀格",
      "Sonet",
      "Stonic",
      "起亚EV2",
      "起亚Syros",
      "SPORTAGE",
      "极睿",
      "极睿新能源",
      "赛图斯(海外)",
      "Futuron",
      "索兰托",
      "索兰托新能源",
      "霸锐",
      "起亚EV9",
      "佳乐",
      "起亚PV5",
      "嘉华(进口)",
      "Tasman",
      "起亚POP",
      "Provo",
      "Venga",
      "起亚CUB",
      "Magentis",
      "欧菲莱斯",
      "起亚Novo",
      "Naimo",
      "起亚SP",
      "Habaniro",
      "Cross GT",
      "起亚KV7",
      "起亚VQ",
      "起亚Kee",
      "速迈",
      "起亚KCV4"
    ]
  },
  {
    "id": "car-10",
    "name": "马自达",
    "models": [
      "马自达2(进口)",
      "马自达3(进口)",
      "马自达6(进口)",
      "马自达CX-3",
      "马自达MX-30",
      "马自达CX-60",
      "马自达CX-70",
      "马自达CX-80",
      "马自达CX-9",
      "马自达CX-90",
      "马自达MX-5",
      "马自达BT-50",
      "R360",
      "Hazumi",
      "Kiyora",
      "魁",
      "ATENZA",
      "Millenia",
      "Shinari",
      "Takeri",
      "KOERU越",
      "Minagi",
      "马自达5",
      "马自达8(进口)",
      "Ryuga",
      "马自达LM55",
      "马自达RX-7",
      "马自达RX-8",
      "马自达EZ-6",
      "马自达CX-30",
      "马自达CX-5",
      "马自达2",
      "马自达2劲翔",
      "马自达3",
      "马自达3星骋",
      "阿特兹",
      "马自达CX-4",
      "马自达CX-8",
      "马自达6",
      "睿翼",
      "马自达CX-7",
      "马自达8"
    ]
  },
  {
    "id": "car-11",
    "name": "标致",
    "models": [
      "标致408",
      "标致408X",
      "标致508",
      "标致5008",
      "标致206",
      "标致207",
      "标致301",
      "标致307",
      "标致308",
      "标致308S",
      "标致2008",
      "标致e2008",
      "标致3008",
      "标致108",
      "标致208",
      "标致e-208",
      "标致P54",
      "Partner",
      "标致Rifter",
      "标致Expert",
      "标致Boxer",
      "Landtrek",
      "Pick Up",
      "标致107",
      "标致BB1",
      "标致iOn",
      "Fractal",
      "EXALT",
      "Instinct",
      "标致408 GT",
      "e-Legend",
      "标致407",
      "标致607",
      "标致608",
      "标致HX1",
      "标致HR1",
      "Quartz",
      "标致4007",
      "标致6008",
      "标致SXC",
      "标致5008经典",
      "标致807",
      "ONYX",
      "标致EX1",
      "标致RCZ",
      "标致SR1"
    ]
  },
  {
    "id": "car-12",
    "name": "雪铁龙",
    "models": [
      "凡尔赛C5 X",
      "雪铁龙C2",
      "雪铁龙C4L",
      "世嘉",
      "爱丽舍",
      "C4世嘉",
      "富康",
      "凯旋",
      "赛纳",
      "雪铁龙C3L",
      "雪铁龙C5",
      "雪铁龙C6",
      "雪铁龙C3-XR",
      "毕加索",
      "雪铁龙ami",
      "雪铁龙C3",
      "雪铁龙eC3",
      "雪铁龙ë-C4",
      "雪铁龙C4",
      "BASALT",
      "雪铁龙Oli",
      "Berlingo",
      "AMI ONE",
      "C-Zero",
      "Lacoste",
      "REVOLTe",
      "雪铁龙C1",
      "C3毕加索",
      "E-MEHARI",
      "爱丽舍(海外)",
      "雪铁龙19_19",
      "雪铁龙BX",
      "雪铁龙CX",
      "AirCross",
      "Tubik",
      "Numero 9",
      "Survolt",
      "雪铁龙GQ",
      "雪铁龙GT"
    ]
  },
  {
    "id": "car-13",
    "name": "铃木",
    "models": [
      "铃木eWX",
      "铃木ACROSS",
      "CELERIO",
      "SOLIO",
      "Spacia",
      "Wagon R",
      "奥拓(海外)",
      "Dzire",
      "速翼特",
      "Baleno",
      "Ciaz",
      "铃木Swace",
      "Fronx",
      "HUSTLER",
      "S-CROSS",
      "S-Presso",
      "吉姆尼(进口)",
      "铃木eVX",
      "英格尼斯",
      "超级维特拉",
      "Misano",
      "Every",
      "A:Wind",
      "铃木G70",
      "铃木iK-2",
      "启悦(海外)",
      "凯泽西",
      "X-Lander",
      "铃木iM-4",
      "铃木iV-4",
      "铃木XBEE",
      "铃木XL7",
      "HANARE",
      "Wako SPO",
      "Equator",
      "奥拓",
      "雨燕",
      "羚羊",
      "启悦",
      "天语 SX4",
      "天语 尚悦",
      "锋驭",
      "维特拉",
      "骁途",
      "北斗星",
      "北斗星X5",
      "派喜",
      "利亚纳",
      "利亚纳A6",
      "吉姆尼",
      "浪迪"
    ]
  },
  {
    "id": "car-14",
    "name": "三菱",
    "models": [
      "三菱D:X",
      "三菱eK新能源",
      "Colt",
      "Mirage",
      "ASX劲炫新能源",
      "Grandis",
      "三菱XFC",
      "奕歌(海外)",
      "帕杰罗(进口)",
      "Delica",
      "Xpander",
      "三菱L200",
      "三菱eK",
      "Attrage",
      "三菱i",
      "LANCER",
      "三菱G4",
      "Galant",
      "三菱eX",
      "欧蓝德(进口)",
      "Endeavor",
      "三菱e-Yi",
      "格蓝迪",
      "三菱AR",
      "三菱XM",
      "三菱3000GT",
      "三菱RA",
      "伊柯丽斯",
      "三菱GR-HEV",
      "欧蓝德经典",
      "帕杰罗速跑",
      "风迪思",
      "蓝瑟",
      "翼神",
      "三菱戈蓝",
      "君阁",
      "菱绅",
      "劲炫ASX",
      "欧蓝德",
      "奕歌",
      "帕杰罗·劲畅",
      "帕杰罗"
    ]
  },
  {
    "id": "car-15",
    "name": "斯柯达",
    "models": [
      "Roadiaq",
      "Citigo",
      "晶锐(海外)",
      "SCALA",
      "SLAVIA",
      "明锐(进口)",
      "昕动(海外)",
      "昕锐(海外)",
      "速派(进口)",
      "KAMIQ",
      "Kushaq",
      "Kylaq",
      "Afriq",
      "Elroq",
      "ENYAQ iV",
      "Epiq",
      "柯珞克(海外)",
      "柯迪亚克(海外)",
      "Favorit",
      "Roomster",
      "Felicia",
      "MissionL",
      "VISION C",
      "VISION D",
      "斯柯达440",
      "速尊",
      "斯柯达VOS",
      "VISION X",
      "Yeti(进口)",
      "VISION S",
      "VISION E",
      "CitiJet",
      "Mountiaq",
      "明锐",
      "速派",
      "柯米克",
      "柯珞克",
      "柯迪亚克",
      "柯迪亚克GT",
      "晶锐",
      "昕动",
      "昕锐",
      "昊锐",
      "Yeti"
    ]
  },
  {
    "id": "car-16",
    "name": "奥迪",
    "models": [
      "奥迪A3",
      "奥迪A4L",
      "奥迪A5L",
      "奥迪A6L",
      "奥迪Q2L",
      "奥迪Q3",
      "奥迪A4",
      "奥迪A6",
      "奥迪A6L新能源",
      "奥迪Q4",
      "奥迪Q5",
      "奥迪e-tron",
      "奥迪A7L",
      "奥迪Q6",
      "奥迪A4(进口)",
      "奥迪A5(进口)",
      "奥迪S4",
      "奥迪S5",
      "奥迪A6(进口)",
      "奥迪S6",
      "奥迪A7",
      "奥迪S7",
      "奥迪A8",
      "奥迪S8",
      "奥迪SQ5",
      "奥迪Q7",
      "奥迪Q8",
      "奥迪SQ7",
      "奥迪A3(进口)",
      "奥迪S3",
      "奥迪A5新能源",
      "奥迪A7新能源",
      "奥迪A8新能源",
      "奥迪Q2",
      "奥迪SQ2",
      "奥迪Q3(进口)",
      "奥迪Q5(进口)",
      "奥迪Q7新能源",
      "奥迪Q8新能源",
      "奥迪Q9",
      "奥迪TT",
      "奥迪TTS",
      "奥迪A0",
      "奥迪Urban",
      "奥迪A1",
      "奥迪A2",
      "奥迪S1",
      "奥迪80",
      "奥迪AI:ME",
      "奥迪Coupe",
      "奥迪100",
      "奥迪Aicon",
      "Prologue",
      "奥迪A9",
      "allroad",
      "奥迪Cross",
      "奥迪Q4(进口)",
      "奥迪Elaine",
      "Nanuk",
      "quattro",
      "奥迪PB18",
      "奥迪R18",
      "奥迪RS 4",
      "奥迪RS 5",
      "奥迪RS 6",
      "奥迪RS 7",
      "奥迪RS Q8",
      "奥迪RS 3",
      "奥迪RS Q3",
      "奥迪RS Q5",
      "奥迪R8",
      "奥迪TT RS"
    ]
  },
  {
    "id": "car-17",
    "name": "宝马",
    "models": [
      "宝马i5",
      "宝马2系",
      "宝马3系",
      "宝马i3",
      "宝马5系",
      "宝马iX1",
      "宝马X1",
      "宝马X3",
      "宝马X5",
      "宝马1系",
      "宝马2系旅行车",
      "宝马5系新能源",
      "宝马X1新能源",
      "宝马X2",
      "宝马M235L",
      "宝马2系(进口)",
      "宝马5系(进口)",
      "宝马7系",
      "宝马8系",
      "宝马i7",
      "宝马X2(进口)",
      "宝马iX",
      "宝马X6",
      "宝马X7",
      "宝马Z4",
      "宝马02系",
      "宝马1系(进口)",
      "宝马3系(进口)",
      "宝马i3(海外)",
      "宝马i5(进口)",
      "宝马iX2",
      "宝马X1(进口)",
      "宝马X3(进口)",
      "宝马iX5",
      "宝马X5(进口)",
      "3.0 CSL",
      "Skytop",
      "Speedtop",
      "Isetta",
      "宝马i3(进口)",
      "Garmisch",
      "宝马3系GT",
      "宝马502",
      "宝马5系GT",
      "宝马6系",
      "宝马6系GT",
      "宝马7系新能源",
      "宝马X4",
      "宝马X7新能源",
      "宝马328",
      "宝马GINA",
      "宝马i8",
      "宝马Z2",
      "宝马Z3",
      "宝马Z8",
      "宝马X7皮卡",
      "宝马M240i",
      "宝马i4 M",
      "宝马M3",
      "宝马M4",
      "宝马i5 M60",
      "宝马M5新能源",
      "宝马M760Le",
      "宝马X3 M",
      "宝马X3 M50",
      "宝马X4 M",
      "宝马iX M60",
      "宝马X5 M",
      "宝马X6 M",
      "宝马XM",
      "宝马M2",
      "宝马M5",
      "宝马M6",
      "宝马M8",
      "宝马1系M",
      "宝马M1"
    ]
  },
  {
    "id": "car-18",
    "name": "奔驰",
    "models": [
      "奔驰A级",
      "奔驰A级AMG",
      "奔驰C级",
      "奔驰C级新能源",
      "奔驰EQE",
      "奔驰E级新能源",
      "奔驰EQA",
      "奔驰EQB",
      "奔驰GLA",
      "奔驰GLB",
      "奔驰GLC新能源",
      "奔驰GLA新能源",
      "奔驰EQC",
      "奔驰GLK级",
      "奔驰E级(进口)",
      "奔驰S级",
      "奔驰S级新能源",
      "奔驰GLC轿跑",
      "奔驰GLE轿跑",
      "奔驰GLE新能源",
      "奔驰G级",
      "奔驰GLS",
      "奔驰CLE",
      "奔驰B级新能源",
      "奔驰C级(进口)",
      "奔驰Citan",
      "奔驰eCitan",
      "奔驰T级",
      "Metris",
      "Vision V",
      "奔驰V级(进口)",
      "威霆(进口)",
      "Sprinter",
      "BlueZero",
      "奔驰A级(进口)",
      "奔驰B级",
      "奔驰CLS",
      "奔驰F800",
      "奔驰F 015",
      "奔驰U级",
      "G-Code",
      "奔驰M级",
      "奔驰GL级",
      "奔驰R级",
      "唯雅诺(进口)",
      "Biome",
      "奔驰CLK级",
      "奔驰CL级",
      "奔驰CSC级",
      "奔驰F125",
      "奔驰SLA级",
      "奔驰SLC",
      "奔驰SLK级",
      "奔驰SLR级",
      "奔驰SL级",
      "奔驰X级",
      "奔驰V级",
      "威霆",
      "唯雅诺",
      "凌特",
      "奔驰C级AMG",
      "奔驰G级AMG",
      "奔驰SL级AMG",
      "AMG GT",
      "AMG ONE",
      "奔驰E级AMG",
      "奔驰S级AMG",
      "奔驰M级AMG",
      "奔驰GL级AMG",
      "Vision",
      "奔驰CL级AMG",
      "奔驰EQS",
      "奔驰G级新能源",
      "奔驰EQT",
      "奔驰EQV",
      "迈巴赫S级",
      "迈巴赫S级新能源",
      "迈巴赫GLS",
      "迈巴赫SL级",
      "迈巴赫G级",
      "至臻豪华概念车"
    ]
  },
  {
    "id": "car-19",
    "name": "比亚迪",
    "models": [
      "元UP",
      "海鸥",
      "海豚",
      "比亚迪e2",
      "比亚迪e3",
      "秦PLUS",
      "秦新能源",
      "驱逐舰05",
      "比亚迪e7",
      "海豹",
      "海豹06",
      "秦L",
      "比亚迪e9",
      "汉L",
      "元PLUS",
      "海狮06",
      "海狮07 EV",
      "宋L DM-i",
      "宋L EV",
      "唐新能源",
      "唐L",
      "比亚迪D1",
      "比亚迪e6",
      "比亚迪M9",
      "夏",
      "护卫舰07",
      "Ocean-S",
      "潮牌01",
      "护卫舰05",
      "Ocean-V",
      "比亚迪T3",
      "比亚迪V3",
      "E-Vali",
      "混动皮卡",
      "比亚迪e1",
      "比亚迪F0",
      "福莱尔",
      "比亚迪e5",
      "比亚迪F3",
      "比亚迪F3R",
      "比亚迪F3新能源",
      "比亚迪G3",
      "比亚迪G3R",
      "比亚迪G5",
      "比亚迪L3",
      "秦",
      "秦Pro",
      "秦Pro新能源",
      "速锐",
      "比亚迪F6",
      "比亚迪G6",
      "思锐",
      "比亚迪S2",
      "元",
      "元Pro",
      "元新能源",
      "宋",
      "宋PLUS",
      "宋PLUS新能源",
      "宋Pro",
      "宋新能源",
      "比亚迪S6",
      "比亚迪S6新能源",
      "比亚迪S7",
      "唐",
      "王朝概念车",
      "比亚迪C6",
      "商",
      "宋MAX",
      "宋MAX新能源",
      "比亚迪M6",
      "比亚迪S8"
    ]
  },
  {
    "id": "car-20",
    "name": "奇瑞",
    "models": [
      "欧萌达3",
      "艾瑞泽5",
      "艾瑞泽5 GT",
      "艾瑞泽8",
      "艾瑞泽8 PRO",
      "瑞虎3x",
      "瑞虎5x",
      "欧萌达",
      "瑞虎7 PLUS",
      "瑞虎8",
      "瑞虎8 PLUS",
      "瑞虎8 PRO",
      "瑞虎8L",
      "瑞虎9 C-DM",
      "艾瑞泽S",
      "艾瑞泽X",
      "猎风",
      "Omoda 4",
      "欧萌达E5",
      "奇瑞L6",
      "欧萌达C7",
      "奇瑞GENE",
      "奇瑞T26",
      "瑞虎X",
      "奇瑞9",
      "瑞虎9L",
      "瑞虎V",
      "劲云",
      "奇瑞iBar",
      "奇瑞@ANT",
      "奇瑞QQ",
      "奇瑞QQ3",
      "奇瑞QQ6",
      "奇瑞QQme",
      "旗云1",
      "风云2",
      "奇瑞A1",
      "奇瑞E2",
      "奇瑞E3",
      "旗云",
      "旗云2",
      "艾瑞泽3",
      "艾瑞泽7",
      "艾瑞泽7e",
      "艾瑞泽GX",
      "风云",
      "奇瑞A3",
      "奇瑞A5",
      "奇瑞E5",
      "奇瑞FV2030",
      "奇瑞α5",
      "奇瑞α7",
      "旗云3",
      "东方之子",
      "旗云5",
      "东方之子6",
      "奇瑞X1",
      "瑞虎",
      "瑞虎3",
      "奇瑞TX",
      "奇瑞β5",
      "瑞虎7 C-DM",
      "探索06",
      "艾瑞泽M7",
      "爱卡",
      "奇瑞QQ新能源",
      "奇瑞X3L"
    ]
  },
  {
    "id": "car-21",
    "name": "吉利汽车",
    "models": [
      "豪越PRO",
      "缤瑞",
      "帝豪",
      "星瑞",
      "缤越",
      "吉利ICON",
      "吉利牛仔",
      "博越",
      "星越L",
      "豪越L",
      "英伦TX4新能源",
      "吉利GX2",
      "熊猫经典",
      "豪情",
      "吉利EC6-RV",
      "吉利GC3",
      "吉利SC3",
      "吉利SC5",
      "吉利SC5-RV",
      "吉利SC6-RV",
      "金刚",
      "金刚财富",
      "金鹰",
      "英伦C5",
      "优利欧",
      "自由舰",
      "帝豪GL",
      "帝豪GL新能源",
      "帝豪L",
      "帝豪L HiP",
      "帝豪新能源",
      "海景",
      "吉利GC5",
      "吉利GC6",
      "吉利GC7",
      "吉利SC7-RV",
      "经典帝豪",
      "远景",
      "博瑞",
      "博瑞新能源",
      "吉利EC8",
      "吉利EC9",
      "吉利KC",
      "吉利GE",
      "缤越新能源",
      "吉利GX5",
      "吉利GX6",
      "吉利SX5",
      "吉利SX6",
      "远景X1",
      "远景X3",
      "帝豪GS",
      "帝豪GSe",
      "帝豪S",
      "吉利EX7",
      "吉利GX7",
      "吉利SX7",
      "星越",
      "星越L增程电动版",
      "星越S",
      "星越新能源",
      "远景S1",
      "远景X6",
      "豪情SUV",
      "豪越",
      "吉利EX8",
      "吉利GX8",
      "吉利EX9",
      "吉利EV7",
      "吉利GV5",
      "吉利SV5",
      "嘉际",
      "嘉际新能源",
      "吉利EV8",
      "英伦TX4",
      "吉利GS",
      "吉利GT",
      "美人豹",
      "中国龙",
      "星瑞L",
      "星越L智擎",
      "吉利增程",
      "帝豪甲醇"
    ]
  },
  {
    "id": "car-22",
    "name": "长安",
    "models": [
      "长安F70蓝鲸",
      "长安UNI-V",
      "锐程PLUS",
      "逸达",
      "逸动PHEV",
      "长安CS75",
      "长安UNI-T",
      "长安UNI-Z",
      "长安UNI-K",
      "长安CS95",
      "长安览拓者新能源",
      "峰景房车",
      "逸动新能源",
      "Horizon",
      "VIIA",
      "长安CS55",
      "长安CD701",
      "长安216",
      "奔奔",
      "奔奔EV",
      "奔奔i",
      "奔奔LOVE",
      "奔奔MINI",
      "长安CX20",
      "悦翔V5",
      "悦翔V3",
      "悦翔",
      "CINTURX",
      "长安CX30",
      "长安E30",
      "长安V802",
      "锐程CC",
      "逸动DT",
      "逸动ET",
      "逸动XT",
      "悦翔V7",
      "志翔",
      "睿骋",
      "睿骋CC",
      "极流",
      "长安CS15",
      "长安CS15EV",
      "长安CS35",
      "御岳",
      "长安VOSS",
      "杰勋",
      "凌轩"
    ]
  },
  {
    "id": "car-23",
    "name": "长城",
    "models": [
      "风骏5",
      "风骏7",
      "金刚炮",
      "炮",
      "炮新能源",
      "山海炮",
      "潮派",
      "X炮",
      "超跑炮",
      "长城精灵",
      "长城C20R",
      "长城C20REV",
      "长城M2",
      "酷熊",
      "凌傲",
      "炫丽",
      "长城C30",
      "长城C30新能源",
      "长城C50",
      "长城C70",
      "长城M1",
      "长城M4",
      "赛弗",
      "赛骏",
      "赛影",
      "长城V80",
      "嘉誉",
      "风骏3",
      "风骏6",
      "风骏新能源",
      "金迪尔"
    ]
  },
  {
    "id": "car-24",
    "name": "哈弗",
    "models": [
      "哈弗猛龙新能源",
      "哈弗H6",
      "哈弗大狗",
      "哈弗猛龙燃油",
      "哈弗H6L",
      "哈弗枭龙MAX",
      "哈弗H5",
      "哈弗H1",
      "哈弗H2",
      "哈弗H2s",
      "哈弗COUPE",
      "哈弗E",
      "哈弗F5",
      "哈弗F7",
      "哈弗F7x",
      "哈弗H3",
      "哈弗H4",
      "哈弗H5经典",
      "哈弗H6S",
      "哈弗H6新能源",
      "哈弗HB-02",
      "哈弗HB-03",
      "哈弗HR-02",
      "哈弗M6",
      "哈弗赤兔",
      "哈弗初恋",
      "哈弗酷狗",
      "哈弗神兽",
      "哈弗神兽新能源",
      "哈弗枭龙",
      "哈弗H7",
      "哈弗H8",
      "哈弗IF"
    ]
  },
  {
    "id": "car-25",
    "name": "五菱汽车",
    "models": [
      "五菱星光",
      "五菱星云",
      "五菱荣光新卡EV",
      "宏光MINIEV",
      "五菱NanoEV",
      "缤果S",
      "五菱缤果",
      "五菱E5",
      "五菱缤果PLUS",
      "五菱星驰",
      "五菱星辰",
      "五菱星光S",
      "星光560",
      "星光560新能源",
      "五菱宏光S3",
      "五菱宏光PLUS",
      "五菱佳辰",
      "五菱凯捷",
      "五菱征程",
      "五菱征程新能源",
      "五菱宏光",
      "五菱宏光V",
      "五菱宏光新能源",
      "五菱荣光",
      "五菱荣光EV",
      "五菱荣光S",
      "五菱荣光V",
      "五菱之光",
      "五菱之光新能源",
      "五菱E10",
      "五菱龙卡",
      "五菱荣光小卡",
      "五菱荣光小卡EV",
      "五菱荣光新卡",
      "五菱扬光电卡",
      "五菱之光小卡",
      "五菱征途",
      "宏光侠",
      "五菱宏光S EV",
      "五菱730",
      "五菱之光V",
      "PN货车",
      "五菱征程经典",
      "五菱荣光新卡房车",
      "五菱微旅车",
      "五菱EV50",
      "五菱电卡",
      "五菱EV80"
    ]
  },
  {
    "id": "car-26",
    "name": "宝骏",
    "models": [
      "宝骏云朵",
      "宝骏享境",
      "宝骏悦也",
      "宝骏悦也皮卡",
      "宝骏悦也Plus",
      "宝骏E6",
      "宝骏云海",
      "智慧概念车",
      "City Car",
      "宝骏E100",
      "宝骏E200",
      "宝骏E300",
      "乐驰",
      "宝骏310",
      "宝骏330",
      "宝骏310W",
      "宝骏610",
      "宝骏630",
      "宝骏RC-5",
      "宝骏Valli",
      "宝骏RC-6",
      "宝骏510",
      "宝骏RS-3",
      "宝骏530",
      "宝骏560",
      "宝骏RS-5",
      "宝骏RS-7",
      "宝骏360",
      "宝骏730",
      "宝骏RM-5",
      "宝骏RM-C"
    ]
  },
  {
    "id": "car-27",
    "name": "一汽",
    "models": [
      "威乐",
      "威志",
      "威志V2",
      "威志V5",
      "威姿",
      "夏利",
      "夏利N5",
      "夏利N7",
      "一汽X121",
      "骏派A50",
      "骏派A70",
      "骏派A70E",
      "骏派CX65",
      "一汽NH2",
      "一汽TFC",
      "一汽NS2",
      "骏派D60",
      "骏派D80",
      "一汽蓝舰H6",
      "森雅R7",
      "森雅R7新能源",
      "森雅R8",
      "森雅S80",
      "森雅鸿雁",
      "森雅R9",
      "森雅M80",
      "佳宝V52",
      "佳宝V55",
      "佳宝V70",
      "佳宝V75",
      "佳宝V77",
      "佳宝V80",
      "佳宝V80新能源",
      "佳宝T50",
      "佳宝T51",
      "佳宝T57",
      "解放T80",
      "解放T90",
      "坤程"
    ]
  },
  {
    "id": "car-28",
    "name": "东南",
    "models": [
      "东南DX8S",
      "东南A7",
      "东南N7",
      "东南DX9",
      "V3菱悦",
      "V5菱致",
      "V6菱仕",
      "东南A5翼舞",
      "东南V4",
      "菱帅",
      "东南V7",
      "东南戈蓝",
      "东南DX3",
      "东南DX3新能源",
      "东南DX5",
      "DX概念车",
      "东南DX7",
      "东南DX8",
      "东南R7",
      "希旺",
      "得利卡"
    ]
  },
  {
    "id": "car-29",
    "name": "海马",
    "models": [
      "白马王子",
      "海马E1",
      "海马Me",
      "海马爱尚",
      "海马爱尚EV",
      "海马王子",
      "青蛙王子",
      "海马E3",
      "海马M3",
      "海马M6",
      "海马C2",
      "海马S5青春版",
      "海马6P",
      "海马8S",
      "海马E5",
      "海马S5",
      "海马C3",
      "福仕达鸿达",
      "福仕达荣达",
      "福仕达腾达",
      "福仕达福卡",
      "海马7X",
      "海马7X新能源",
      "海马INJOY",
      "丘比特",
      "福美来",
      "福美来F5",
      "海福星",
      "海马3",
      "欢动",
      "海马M8",
      "海马S7",
      "海马骑士",
      "VF00概念车",
      "福美来E7",
      "福美来F7",
      "福美来MPV",
      "海马V70",
      "普力马",
      "普力马EV"
    ]
  },
  {
    "id": "car-30",
    "name": "中华",
    "models": [
      "中华豚",
      "中华EV",
      "中华H220",
      "中华H230",
      "中华H230EV",
      "中华C3",
      "中华E5",
      "中华H3",
      "中华H320",
      "中华H330",
      "中华H530",
      "中华骏捷FRV",
      "中华骏捷FSV",
      "中华骏捷",
      "中华尊驰",
      "中华V3",
      "中华V5",
      "中华V6",
      "中华V7",
      "中华V9",
      "中华酷宝"
    ]
  },
  {
    "id": "car-31",
    "name": "东风风行",
    "models": [
      "星海V9",
      "风行游艇V9",
      "星海T5",
      "风行S50EV",
      "风行S60EV",
      "星海S7",
      "风行T5",
      "风行T5 EVO",
      "风行雷霆",
      "星海X5",
      "风行游艇",
      "菱智",
      "菱智新能源",
      "风行M7",
      "菱智PLUS",
      "星海V6",
      "风行M7新能源",
      "风行旗舰MPV",
      "景逸",
      "景逸S50",
      "风行T1EV",
      "风行SX6",
      "风行X5",
      "景逸SUV",
      "景逸X3",
      "景逸X5",
      "景逸X6",
      "景逸XV",
      "风行T5L",
      "景逸X7",
      "风行S500",
      "风行M6",
      "风行CM7",
      "风行F600"
    ]
  },
  {
    "id": "car-32",
    "name": "东风风神",
    "models": [
      "东风风神E70",
      "奕炫",
      "奕炫MAX",
      "SKY EV01",
      "东风风神AX7",
      "皓瀚",
      "皓极",
      "奕炫GS",
      "i-Cabin",
      "东风风神E30",
      "东风风神H30",
      "东风风神S30",
      "东风风神A60",
      "东风风神A30",
      "东风风神E60",
      "东风风神L60",
      "奕炫EV",
      "东风A9",
      "东风风神AX1",
      "东风风神AX3",
      "东风风神AX4",
      "东风风神EX1",
      "东风风神AX5",
      "东风风神e.π",
      "风诺"
    ]
  },
  {
    "id": "car-33",
    "name": "东风风光",
    "models": [
      "风光MINIEV",
      "风光500",
      "风光S560",
      "风光580",
      "风光ix5",
      "风光S580",
      "风光380",
      "风光E380",
      "风光330",
      "风光S-007",
      "德先T8",
      "风光E1",
      "风光E3",
      "风光580Pro",
      "风光580新能源",
      "风光ix7",
      "风光360",
      "风光370",
      "风光",
      "风光350"
    ]
  },
  {
    "id": "car-34",
    "name": "荣威",
    "models": [
      "荣威D7",
      "荣威E6",
      "荣威Ei5",
      "荣威i5",
      "荣威RX5新能源",
      "荣威iMAX8",
      "荣威RX5",
      "明珠",
      "家越06",
      "家越07",
      "家越09",
      "荣威e50",
      "荣威350",
      "荣威360",
      "荣威550",
      "荣威e550",
      "荣威i6 MAX",
      "荣威i6经典",
      "荣威i6新能源",
      "荣威750",
      "荣威950",
      "荣威e950",
      "荣威RX3",
      "Vision-E",
      "鲸",
      "龙猫",
      "荣威RX9",
      "荣威W5",
      "荣威RX8",
      "Vision-R",
      "飞凡F7",
      "飞凡R7",
      "飞凡RC7",
      "飞凡ER6",
      "飞凡R-AURA",
      "飞凡RYZR"
    ]
  },
  {
    "id": "car-35",
    "name": "名爵",
    "models": [
      "MG5",
      "MG6",
      "MG7",
      "MG ES5",
      "MG 3",
      "MG漫巡",
      "MG 5",
      "名爵EZS纯电动",
      "Cyber X",
      "名爵HS",
      "MG V80",
      "名爵3",
      "名爵3SW",
      "MG5天蝎座",
      "名爵6新能源",
      "锐行",
      "名爵ICON",
      "名爵ZS",
      "Hector",
      "MG ONE",
      "MG领航",
      "MG领航新能源",
      "名爵HS新能源",
      "名爵iGS",
      "锐腾",
      "名爵IS32",
      "名爵TF"
    ]
  },
  {
    "id": "car-36",
    "name": "奔腾",
    "models": [
      "奔腾小马",
      "奔腾B70",
      "悦意03",
      "悦意07",
      "奔腾NAT",
      "奔腾概念轿车",
      "E311",
      "奔腾概念SUV",
      "奔腾B30",
      "奔腾B30EV",
      "奔腾B50",
      "奔腾B90",
      "奔腾T33",
      "奔腾X4",
      "奔腾X40",
      "奔腾X40新能源",
      "奔腾B70S",
      "奔腾T55",
      "奔腾T77",
      "奔腾T90",
      "奔腾X6",
      "奔腾X70",
      "奔腾X80",
      "奔腾E01",
      "奔腾T99",
      "奔腾M9"
    ]
  },
  {
    "id": "car-37",
    "name": "广汽传祺",
    "models": [
      "传祺ES9",
      "传祺E8新能源",
      "影豹",
      "传祺GS3",
      "传祺GS4",
      "传祺GS8",
      "传祺向往S7",
      "传祺向往S9",
      "传祺M6",
      "传祺E8",
      "传祺E9",
      "传祺向往M8",
      "传祺A79",
      "传祺越7",
      "传祺GOVE",
      "传祺GOVY",
      "E-Linker",
      "iSPACE",
      "EV coupe",
      "传祺E-jet",
      "传祺GA3",
      "传祺GA3S视界",
      "传祺GA4",
      "传祺GA5",
      "传祺GA5新能源",
      "传祺GA6",
      "WitStar",
      "传祺GA7",
      "传祺GA8",
      "EnSpirit",
      "X-POWER",
      "传祺GS4新能源",
      "影酷",
      "传祺GS5",
      "传祺GS6",
      "传祺GS7",
      "EnLight",
      "传祺向往E8"
    ]
  },
  {
    "id": "car-38",
    "name": "北京汽车",
    "models": [
      "北京EU5",
      "北京EU7",
      "魔方",
      "北京X7",
      "北京汽车E系列",
      "绅宝D20",
      "北京U5",
      "北京汽车C70",
      "绅宝CC",
      "绅宝D50",
      "绅宝D60",
      "RADIANCE",
      "北京U7",
      "北京汽车C60F",
      "北京汽车T60",
      "绅宝D70",
      "绅宝D80",
      "北京汽车C90L",
      "北京EX3",
      "北京X3",
      "绅宝X25",
      "绅宝X35",
      "北京EX5",
      "北京X5",
      "绅宝X55",
      "绅宝X65",
      "耀",
      "智行"
    ]
  },
  {
    "id": "car-39",
    "name": "北汽昌河",
    "models": [
      "昌河北斗星",
      "昌河北斗星X5",
      "爱迪尔",
      "北斗星X5E",
      "北汽EC100",
      "北汽EV2",
      "北汽昌河A6",
      "北汽昌河Q25",
      "北汽昌河Q35",
      "北汽昌河Q7",
      "北汽昌河M70",
      "福瑞达",
      "北汽EV5",
      "北汽昌河M50S",
      "昌河福运",
      "福瑞达K11S",
      "福瑞达K12S",
      "福瑞达K21",
      "福瑞达K22"
    ]
  },
  {
    "id": "car-40",
    "name": "江淮瑞风",
    "models": [
      "瑞风E4",
      "瑞风RF8",
      "瑞风E3",
      "瑞风M3",
      "瑞风L5",
      "瑞风L6 MAX",
      "瑞风M4"
    ]
  },
  {
    "id": "car-41",
    "name": "江淮汽车",
    "models": [
      "江淮X8 E家",
      "DEFINE-S",
      "DEFINE-X"
    ]
  },
  {
    "id": "car-42",
    "name": "众泰",
    "models": [
      "江南T11",
      "江南TT",
      "云100",
      "芝麻",
      "众泰E20",
      "众泰E200",
      "众泰ES330",
      "众泰Z100",
      "众泰Z200",
      "众泰Z200HB",
      "众泰Z300",
      "众泰Z360",
      "众泰Z500",
      "众泰Z560",
      "众泰Z700",
      "众泰2008",
      "众泰5008",
      "众泰ET450",
      "众泰T100",
      "众泰T200",
      "众泰T300",
      "大迈X5",
      "众泰SR7",
      "众泰T500",
      "众泰TS5",
      "大迈X7",
      "众泰SR9",
      "众泰SR9新能源",
      "众泰T600",
      "众泰T700",
      "众泰T800",
      "众泰M300",
      "众泰B40",
      "众泰V10",
      "众泰M10EV"
    ]
  },
  {
    "id": "car-43",
    "name": "凯翼",
    "models": [
      "轩度",
      "轩度EV",
      "炫界",
      "炫界Pro",
      "炫界Pro EV",
      "凯翼昆仑",
      "凯翼昆仑L8",
      "凯翼昆仑新能源",
      "凯翼江豚E5",
      "凯翼江豚E7",
      "唐古",
      "凯翼FX12",
      "凯翼C3",
      "凯翼C3R",
      "凯翼C3R EV",
      "凯翼E3",
      "凯翼E5 EV",
      "凯翼CX3",
      "凯翼X3",
      "凯翼i-CX",
      "凯翼V3",
      "凯翼X5",
      "凯翼X7",
      "凯翼V7"
    ]
  },
  {
    "id": "car-44",
    "name": "东风小康",
    "models": [
      "东风小康C35",
      "东风小康C36",
      "东风小康C37",
      "东风小康C56",
      "东风小康EC36",
      "东风小康K05S",
      "东风小康K07S",
      "创富牛卡",
      "东风小康C31",
      "东风小康C32",
      "东风小康C51",
      "东风小康C52",
      "东风小康D51",
      "东风小康D52",
      "东风小康D71",
      "东风小康D72",
      "东风小康K01",
      "东风小康K02",
      "东风小康C55",
      "东风小康F505",
      "东风小康K07",
      "东风小康K17",
      "东风小康V07S",
      "东风小康V27",
      "东风小康V29",
      "东风小康C71",
      "东风小康C72",
      "东风小康K06",
      "东风小康V21",
      "东风小康V22"
    ]
  },
  {
    "id": "car-45",
    "name": "金杯",
    "models": [
      "吉运E6",
      "海狮王",
      "吉运E9",
      "金杯海狮",
      "金杯海狮EV",
      "金杯快运",
      "金杯海狮王",
      "金杯海狮H1",
      "新海豚EV",
      "小海狮X30",
      "新海狮EV",
      "新海狮X30L",
      "金杯T3",
      "金杯T5",
      "金杯金卡S2",
      "金杯金卡S3",
      "金杯金卡S6",
      "新海狮",
      "华晨金杯750",
      "金海狮M经典",
      "金海狮经典",
      "海星A7",
      "海星A9",
      "海星T20",
      "海星T22",
      "金杯T10",
      "金杯T12",
      "金杯T20",
      "金杯T22",
      "金杯T2S",
      "金杯T50S",
      "金杯T52S",
      "鑫卡S50",
      "鑫卡S52",
      "鑫源T20S",
      "鑫源T22S",
      "鑫源T30S",
      "鑫源T32S",
      "鑫源T50S",
      "鑫源T52S",
      "新海狮S",
      "金杯S50",
      "观境",
      "金杯F50",
      "领坤EV",
      "阁瑞斯",
      "金杯大海狮",
      "智尚S30",
      "智尚S35",
      "金杯S70",
      "西部牛仔",
      "小金牛",
      "大力神",
      "大力神K5",
      "金典",
      "雷龙"
    ]
  },
  {
    "id": "car-46",
    "name": "长安凯程",
    "models": [
      "长安睿行M60",
      "长安之星5",
      "长安之星9EV",
      "欧诺S",
      "长安神骐PLUS",
      "长安神骐T30",
      "长安星卡",
      "长安星卡EV",
      "长安星卡PLUS",
      "长安睿行M80",
      "长安睿行M90",
      "长安凯程F300",
      "长安睿行ES30",
      "长安欧尚A600",
      "长安睿行S50",
      "长安睿行S50T",
      "长行",
      "长行EV",
      "长安星光",
      "长安星光4500",
      "长安之星",
      "长安之星2",
      "长安之星3",
      "长安之星7",
      "长安之星9",
      "长安之星S460",
      "金牛星",
      "长安神骐T10",
      "长安神骐T20",
      "长安星卡C系",
      "长安星卡L系",
      "长安睿行M70",
      "长安尊行",
      "长安凯程F70",
      "长安神骐F30",
      "长安神骐F50"
    ]
  },
  {
    "id": "car-47",
    "name": "埃安",
    "models": [
      "AION UT",
      "AION S",
      "AION i60",
      "AION V",
      "AION Y",
      "AION LX",
      "TIME",
      "广汽新能源2U",
      "广汽新能源2US",
      "Enverge",
      "传祺GE3",
      "ENTRANZE",
      "AION AY5"
    ]
  },
  {
    "id": "car-48",
    "name": "阿斯顿·马丁",
    "models": [
      "Vanquish",
      "Valhalla",
      "Valiant",
      "Valour",
      "Victor",
      "战神",
      "Cygnet",
      "Rapide",
      "Rapide E",
      "拉共达Taraf",
      "Ulster",
      "Virage",
      "Vulcan"
    ]
  },
  {
    "id": "car-49",
    "name": "阿维塔",
    "models": [
      "阿维塔06",
      "阿维塔07",
      "阿维塔11"
    ]
  },
  {
    "id": "car-50",
    "name": "阿尔法·罗密欧",
    "models": [
      "Junior",
      "MiTo",
      "Gloria"
    ]
  },
  {
    "id": "car-51",
    "name": "爱驰",
    "models": [
      "爱驰U5",
      "爱驰U6",
      "爱驰U7"
    ]
  },
  {
    "id": "car-52",
    "name": "AUXUN傲旋",
    "models": [
      "傲旋",
      "傲旋乘风",
      "小傲旋"
    ]
  },
  {
    "id": "car-53",
    "name": "安徽猎豹",
    "models": [
      "嘉远KOMI"
    ]
  },
  {
    "id": "car-54",
    "name": "安凯客车",
    "models": [
      "安凯快乐运",
      "安凯Q5",
      "宝斯通"
    ]
  },
  {
    "id": "car-55",
    "name": "ABT",
    "models": [
      "ABT A1",
      "ABT RS 3",
      "ABT 高尔夫",
      "ABT RS 4",
      "ABT RS 5",
      "ABT S4",
      "ABT S5",
      "ABT A6",
      "ABT RS 6",
      "ABT RS 7",
      "ABT S6",
      "ABT SQ2",
      "ABT Q5",
      "ABT SQ5",
      "ABT Q8",
      "ABT SQ7",
      "ABT SQ8",
      "ABT Urus",
      "ABT 迈特威",
      "ABT R8",
      "ABT S1",
      "ABT A3",
      "ABT A4",
      "ABT A5",
      "ABT QS7",
      "ABT A8L",
      "ABT TT"
    ]
  },
  {
    "id": "car-56",
    "name": "AC Cars",
    "models": [
      "AC Ace",
      "AC Cobra"
    ]
  },
  {
    "id": "car-57",
    "name": "AFEELA",
    "models": [
      "AFEELA 1"
    ]
  },
  {
    "id": "car-58",
    "name": "AITO 问界",
    "models": [
      "问界M5",
      "问界M7",
      "问界M8",
      "问界M9"
    ]
  },
  {
    "id": "car-59",
    "name": "Alpha Motor",
    "models": [
      "Montage"
    ]
  },
  {
    "id": "car-60",
    "name": "Apollo",
    "models": [
      "Apollo N",
      "Arrow"
    ]
  },
  {
    "id": "car-61",
    "name": "Aria",
    "models": [
      "Aria FXE"
    ]
  },
  {
    "id": "car-62",
    "name": "Ariel",
    "models": [
      "Hipercar"
    ]
  },
  {
    "id": "car-63",
    "name": "Atlis",
    "models": [
      "Atlis XT"
    ]
  },
  {
    "id": "car-64",
    "name": "ATS",
    "models": [
      "ATS GT"
    ]
  },
  {
    "id": "car-65",
    "name": "Aurus",
    "models": [
      "Senat"
    ]
  },
  {
    "id": "car-66",
    "name": "埃尚",
    "models": [
      "埃尚"
    ]
  },
  {
    "id": "car-67",
    "name": "艾康尼克",
    "models": [
      "MUSE",
      "艾康尼克七系"
    ]
  },
  {
    "id": "car-68",
    "name": "阿娜亚",
    "models": [
      "阿娜亚依维柯"
    ]
  },
  {
    "id": "car-69",
    "name": "阿莫迪罗",
    "models": [
      "挑战者系列",
      "征服者系列",
      "先锋官",
      "锐行者"
    ]
  },
  {
    "id": "car-70",
    "name": "北京越野",
    "models": [
      "北京越野BJ30",
      "北京越野BJ40",
      "北京越野BJ60",
      "北京・城市猎人",
      "北京越野B61",
      "北京越野B70",
      "北京越野BJ20",
      "北京越野B90",
      "北京越野BJ80",
      "北京越野BJ90",
      "北京越野F40",
      "悦"
    ]
  },
  {
    "id": "car-71",
    "name": "保时捷",
    "models": [
      "Taycan",
      "Panamera",
      "Macan",
      "Macan新能源",
      "Cayenne",
      "保时捷718",
      "保时捷911",
      "保时捷963",
      "Pajun",
      "Boxster",
      "Cayman",
      "保时捷356",
      "保时捷917",
      "保时捷968"
    ]
  },
  {
    "id": "car-72",
    "name": "北京汽车制造厂",
    "models": [
      "212经典",
      "勇士",
      "vala pro",
      "北汽小河马",
      "鲸卡T6",
      "鲸卡T7",
      "鲸卡T7EV",
      "卡路里",
      "勇士皮卡",
      "家宝",
      "元宝",
      "锐铃",
      "北汽L6H",
      "嫦娥miniEV",
      "北汽豹",
      "鲸卡",
      "北汽大猫",
      "北汽小猫",
      "战旗",
      "北京BW007",
      "骑士S12",
      "陆霸",
      "越铃",
      "陆铃",
      "战旗皮卡"
    ]
  },
  {
    "id": "car-73",
    "name": "宾利",
    "models": [
      "飞驰插电混动",
      "添越",
      "添越插电混动",
      "欧陆插电混动",
      "EXP 15",
      "Bacalar",
      "Batur",
      "Speed 6",
      "慕尚",
      "飞驰",
      "雅骏",
      "雅致",
      "Blower",
      "欧陆"
    ]
  },
  {
    "id": "car-74",
    "name": "北汽新能源",
    "models": [
      "北汽新能源EC",
      "北汽新能源EC3",
      "北汽新能源EV",
      "北汽新能源EU",
      "北汽新能源EH",
      "北汽新能源EC5",
      "北汽新能源EX",
      "EX概念车"
    ]
  },
  {
    "id": "car-75",
    "name": "宝沃",
    "models": [
      "宝沃BX3",
      "宝沃BX5",
      "宝沃BX6",
      "宝沃BXi5",
      "宝沃BX7",
      "宝沃BXi7",
      "Isabella"
    ]
  },
  {
    "id": "car-76",
    "name": "铂驰",
    "models": [
      "铂驰VC系列",
      "铂驰NV系列",
      "铂驰SP系列",
      "铂驰T系列"
    ]
  },
  {
    "id": "car-77",
    "name": "布加迪",
    "models": [
      "Bolide",
      "Chiron",
      "Divo",
      "Galibier",
      "威航"
    ]
  },
  {
    "id": "car-78",
    "name": "博速",
    "models": [
      "博速 G级",
      "博速 V级",
      "博速 A级",
      "博速 C级",
      "博速 CLS",
      "博速 E级",
      "博速Taycan",
      "博速 EQS",
      "博速 S级",
      "博速古思特",
      "博速 GLB",
      "博速 EQC",
      "博速 GLC",
      "博速 GLE",
      "博速 GLS",
      "博速 库里南",
      "博速 GT",
      "博速 SL级",
      "博速保时捷911",
      "博速 B级",
      "博速 GLA",
      "博速 M级",
      "博速 GL级",
      "博速 CL级",
      "博速 SLK级",
      "博速 SLS级",
      "博速 X级"
    ]
  },
  {
    "id": "car-79",
    "name": "巴菲特汽车",
    "models": [
      "巴菲特600",
      "巴菲特S",
      "巴菲特9"
    ]
  },
  {
    "id": "car-80",
    "name": "百智新能源",
    "models": [
      "百智大猫",
      "百智大熊"
    ]
  },
  {
    "id": "car-81",
    "name": "BAC",
    "models": [
      "Mono"
    ]
  },
  {
    "id": "car-82",
    "name": "BAO",
    "models": [
      "BAO GX5"
    ]
  },
  {
    "id": "car-83",
    "name": "Bizzarrini",
    "models": [
      "Giotto"
    ]
  },
  {
    "id": "car-84",
    "name": "Bowler",
    "models": [
      "Bowler卫士"
    ]
  },
  {
    "id": "car-85",
    "name": "保斐利",
    "models": [
      "La JOYA"
    ]
  },
  {
    "id": "car-86",
    "name": "北京清行",
    "models": [
      "清行400"
    ]
  },
  {
    "id": "car-87",
    "name": "北汽威旺",
    "models": [
      "北汽007",
      "北汽威旺BQ5",
      "北汽威旺S50",
      "北汽威旺M50F",
      "北汽威旺M60",
      "北汽威旺205",
      "北汽威旺306",
      "北汽威旺307",
      "北汽威旺M20",
      "北汽威旺M30",
      "北汽威旺M35"
    ]
  },
  {
    "id": "car-88",
    "name": "北汽幻速",
    "models": [
      "北汽幻速S2",
      "北汽幻速C21",
      "北汽幻速S3",
      "北汽幻速S4",
      "北汽幻速S5",
      "北汽幻速S6",
      "北汽幻速S7",
      "北汽幻速C60",
      "北汽幻速H3",
      "北汽幻速H5",
      "北汽幻速H2",
      "北汽幻速H2V",
      "北汽幻速H6"
    ]
  },
  {
    "id": "car-89",
    "name": "北汽泰普",
    "models": [
      "北汽泰普致境",
      "北汽泰普致享",
      "瀚海苍穹",
      "蓝鲸",
      "摩登部落",
      "致锋",
      "致臻"
    ]
  },
  {
    "id": "car-90",
    "name": "北汽瑞翔",
    "models": [
      "HOEN O2",
      "北汽瑞翔X3",
      "北汽瑞翔X5",
      "博腾V1",
      "博腾M3",
      "博腾V2",
      "博腾V2 EV"
    ]
  },
  {
    "id": "car-91",
    "name": "北汽道达",
    "models": [
      "道达V8"
    ]
  },
  {
    "id": "car-92",
    "name": "博郡汽车",
    "models": [
      "博郡iV6",
      "博郡iV7"
    ]
  },
  {
    "id": "car-93",
    "name": "宝腾",
    "models": [
      "宝腾X50",
      "宝腾X70"
    ]
  },
  {
    "id": "car-94",
    "name": "宝骐汽车",
    "models": [
      "帅骐"
    ]
  },
  {
    "id": "car-95",
    "name": "宾尼法利纳",
    "models": [
      "Teorema",
      "Battista",
      "H2 Speed"
    ]
  },
  {
    "id": "car-96",
    "name": "比克汽车",
    "models": [
      "比克兴熠"
    ]
  },
  {
    "id": "car-97",
    "name": "比德文汽车",
    "models": [
      "比德文E3"
    ]
  },
  {
    "id": "car-98",
    "name": "比速汽车",
    "models": [
      "比速T3",
      "比速T5",
      "比速T7",
      "比速M3"
    ]
  },
  {
    "id": "car-99",
    "name": "长安欧尚",
    "models": [
      "奔奔E-Star",
      "长安欧尚520",
      "长安欧尚Z6",
      "长安欧尚启悦",
      "长安欧尚科尚6",
      "奔奔mini-e",
      "尼欧Ⅱ",
      "欧尚E01",
      "欧力威",
      "欧力威EV",
      "OSHAN",
      "长安欧尚科赛3",
      "长安欧尚科赛5",
      "长安欧尚X5",
      "长安欧尚X7",
      "长安欧尚X70A",
      "长安欧尚CX70",
      "长安欧尚科赛",
      "长安欧尚A800",
      "长安欧尚科尚",
      "长安欧尚科尚EV",
      "欧诺新能源"
    ]
  },
  {
    "id": "car-100",
    "name": "创维汽车",
    "models": [
      "创维D10",
      "创维D07L",
      "创维创业者L",
      "创维D07K",
      "创维K10P",
      "创维EV6",
      "创维K10L",
      "创维D11",
      "创维Q",
      "天美汽车ET5"
    ]
  },
  {
    "id": "car-101",
    "name": "曹操汽车",
    "models": [
      "曹操60"
    ]
  },
  {
    "id": "car-102",
    "name": "长安跨越",
    "models": [
      "跨越王X7",
      "跨越星V3",
      "跨越星V5",
      "跨越星V5 EV",
      "跨越星V7",
      "跨越星光 EV",
      "跨越王X1",
      "跨越王X1 EV",
      "跨越王X3",
      "跨越王X3 EV",
      "跨越者D1",
      "跨越者D3",
      "跨越者D5",
      "新豹T1",
      "新豹T3",
      "新豹T3 EV",
      "新豹T5",
      "星塔",
      "星塔EV",
      "跨越王X5",
      "长安V3",
      "长安V5",
      "跨越王",
      "新豹3",
      "新豹MINI",
      "跨越王F3"
    ]
  },
  {
    "id": "car-103",
    "name": "橙仕",
    "models": [
      "橙仕X7",
      "橙仕01",
      "橙仕X2",
      "橙仕X5",
      "橙仕X6"
    ]
  },
  {
    "id": "car-104",
    "name": "成功汽车",
    "models": [
      "角马",
      "骆驼",
      "斑马",
      "骆驼微卡",
      "星马T3E",
      "成功S10",
      "成功BEV6",
      "成功V1",
      "成功V2",
      "成功V2E",
      "成功K1",
      "成功K2",
      "成功K3",
      "成功K32",
      "成功K4",
      "成功X1",
      "劲驰X1"
    ]
  },
  {
    "id": "car-105",
    "name": "车驰汽车",
    "models": [
      "车驰Vito",
      "车驰V系列",
      "车驰Daily",
      "车驰T系列"
    ]
  },
  {
    "id": "car-106",
    "name": "Canoo",
    "models": [
      "Canoo EV"
    ]
  },
  {
    "id": "car-107",
    "name": "Caterham",
    "models": [
      "Seven"
    ]
  },
  {
    "id": "car-108",
    "name": "Conquest",
    "models": [
      "Evada"
    ]
  },
  {
    "id": "car-109",
    "name": "Continental",
    "models": [
      "AmbienC3"
    ]
  },
  {
    "id": "car-110",
    "name": "Corbellati",
    "models": [
      "Missile"
    ]
  },
  {
    "id": "car-111",
    "name": "Cupra",
    "models": [
      "e-Racer",
      "Terramar",
      "Tavascan",
      "Ibiza"
    ]
  },
  {
    "id": "car-112",
    "name": "Czinger",
    "models": [
      "Hyper GT"
    ]
  },
  {
    "id": "car-113",
    "name": "昶洧",
    "models": [
      "昶洧TP-01",
      "昶洧 SUV"
    ]
  },
  {
    "id": "car-114",
    "name": "超境汽车",
    "models": [
      "共创坦克300"
    ]
  },
  {
    "id": "car-115",
    "name": "车和家",
    "models": [
      "车和家SEV"
    ]
  },
  {
    "id": "car-116",
    "name": "长安启源",
    "models": [
      "长安启源A05",
      "长安启源A07",
      "长安启源Q07",
      "长安启源E07",
      "长安猎手 K50",
      "长安Lumin"
    ]
  },
  {
    "id": "car-117",
    "name": "长江EV",
    "models": [
      "逸酷",
      "奕阁"
    ]
  },
  {
    "id": "car-118",
    "name": "大通",
    "models": [
      "大拿M1",
      "领地",
      "星际X SUV",
      "大家7",
      "大家9",
      "大通G10",
      "大通G90",
      "新途EV80",
      "新途EV90",
      "新途V90",
      "新途远界",
      "探索家星际H",
      "星际X",
      "星际X新能源",
      "大家6",
      "大通D60",
      "大家5",
      "大通G20",
      "大通EV30",
      "新途V70",
      "伊思坦纳",
      "大通T70",
      "大通T90",
      "大通T90EV",
      "大通T90房车",
      "星际牛魔王",
      "大拿V1",
      "大拿T1",
      "新途EV70",
      "星际EV"
    ]
  },
  {
    "id": "car-119",
    "name": "东风",
    "models": [
      "御风EM27",
      "福小瑞",
      "小霸王W16",
      "睿立达V6E",
      "睿立达V5",
      "睿立达V7",
      "睿立达V8E",
      "途逸T7",
      "猛士M50",
      "御风P16",
      "俊风EV30",
      "东风凯普特",
      "东风概念车",
      "俊风ER30",
      "俊风E11K",
      "俊风E17",
      "俊风EJ30",
      "东风HUV",
      "御风S16",
      "猛士",
      "俊风CV03",
      "睿立达EV90",
      "东风皮卡",
      "虎视",
      "帕拉索新能源",
      "帕拉索",
      "锐骐",
      "锐骐6 pro",
      "锐骐6新能源",
      "锐骐7",
      "锐骐7新能源",
      "郑州日产Z9",
      "奥丁",
      "帅客",
      "帅客新能源",
      "御轩",
      "俊风",
      "锐骐6",
      "锐骐多功能车",
      "锐骐新能源"
    ]
  },
  {
    "id": "car-120",
    "name": "DS",
    "models": [
      "DS 4S",
      "DS 5LS",
      "DS 5",
      "DS 9",
      "DS 9新能源",
      "DS 6",
      "DS 7",
      "DS 4新能源",
      "DS N°4",
      "DS N°8",
      "DS 3",
      "DS 3新能源",
      "DS 7(海外)",
      "DS N°7",
      "E-Tense",
      "DS 3经典",
      "DS 4",
      "神韵",
      "DS 5(进口)",
      "DS23"
    ]
  },
  {
    "id": "car-121",
    "name": "大运",
    "models": [
      "悦虎",
      "远志M1",
      "大运皮卡",
      "远志M2"
    ]
  },
  {
    "id": "car-122",
    "name": "东风御风",
    "models": [
      "御风EM26",
      "御风",
      "御风EV",
      "御风房车"
    ]
  },
  {
    "id": "car-123",
    "name": "大力牛魔王",
    "models": [
      "大力牛魔王D02",
      "大力牛魔王D05",
      "大力牛魔王D01"
    ]
  },
  {
    "id": "car-124",
    "name": "道奇",
    "models": [
      "凯领",
      "Charger",
      "HORNET",
      "酷威",
      "Durango",
      "凯领(海外)",
      "挑战者",
      "Rampage",
      "Dart",
      "锋哲",
      "酷搏",
      "翼龙",
      "道奇D100",
      "道奇M80",
      "挑战者 SRT",
      "蝰蛇"
    ]
  },
  {
    "id": "car-125",
    "name": "东风富康",
    "models": [
      "e爱丽舍",
      "富康ES500",
      "富康ES600"
    ]
  },
  {
    "id": "car-126",
    "name": "东风风度",
    "models": [
      "帕拉丁",
      "东风风度MX3",
      "东风风度MX5",
      "东风风度MX6"
    ]
  },
  {
    "id": "car-127",
    "name": "大乘汽车",
    "models": [
      "大乘E20",
      "大乘G60",
      "大乘G60E",
      "大乘G60S",
      "大乘G70S"
    ]
  },
  {
    "id": "car-128",
    "name": "大发",
    "models": [
      "大发me:Mo",
      "大发Osanpo",
      "TAFT",
      "Rocky",
      "Copen",
      "ICO ICO",
      "PICO",
      "Wai Wai",
      "大发D-base",
      "Sirion",
      "MATERIA",
      "Mira",
      "DN Trec",
      "大发FX",
      "Kopen",
      "大发D-R",
      "森雅"
    ]
  },
  {
    "id": "car-129",
    "name": "电动屋",
    "models": [
      "悦01",
      "YOUNG光小新"
    ]
  },
  {
    "id": "car-130",
    "name": "Datsun",
    "models": [
      "mi-DO",
      "on-DO",
      "redi-GO"
    ]
  },
  {
    "id": "car-131",
    "name": "DeLorean",
    "models": [
      "Alpha5",
      "DMC-24",
      "Alpha3",
      "Alpha4",
      "Alpha2",
      "DMC-12"
    ]
  },
  {
    "id": "car-132",
    "name": "DEUS Automobiles",
    "models": [
      "Vayanne"
    ]
  },
  {
    "id": "car-133",
    "name": "Drako",
    "models": [
      "Dragon"
    ]
  },
  {
    "id": "car-134",
    "name": "东风奕派",
    "models": [
      "eπ007",
      "eπ008",
      "纳米06",
      "eπ2024",
      "eπ 2023",
      "奕派M8",
      "2024概念皮卡",
      "纳米BOX",
      "纳米EX1"
    ]
  },
  {
    "id": "car-135",
    "name": "东风氢舟",
    "models": [
      "氢舟e·H2"
    ]
  },
  {
    "id": "car-136",
    "name": "大迪",
    "models": [
      "大迪福顺"
    ]
  },
  {
    "id": "car-137",
    "name": "戴姆勒",
    "models": [
      "戴姆勒DS420"
    ]
  },
  {
    "id": "car-138",
    "name": "电咖",
    "models": [
      "电咖·EV10"
    ]
  },
  {
    "id": "car-139",
    "name": "达契亚",
    "models": [
      "Dokker",
      "Hipster",
      "达契亚Logan",
      "达契亚纯电小型车",
      "Striker",
      "Spring",
      "Bigster",
      "达契亚Lodgy"
    ]
  },
  {
    "id": "car-140",
    "name": "道朗格",
    "models": [
      "TAHOE太浩",
      "YUKON育空",
      "Celestiq",
      "科尔维特"
    ]
  },
  {
    "id": "car-141",
    "name": "212",
    "models": [
      "远征平台 X"
    ]
  },
  {
    "id": "car-142",
    "name": "e.GO",
    "models": [
      "e.wave X"
    ]
  },
  {
    "id": "car-143",
    "name": "EdisonFuture",
    "models": [
      "EF1-T"
    ]
  },
  {
    "id": "car-144",
    "name": "Electra Meccanica",
    "models": [
      "SOLO"
    ]
  },
  {
    "id": "car-145",
    "name": "法拉利",
    "models": [
      "法拉利499P",
      "法拉利KC23",
      "法拉利F76",
      "法拉利SP-8",
      "Amalfi",
      "法拉利296",
      "法拉利849",
      "Roma",
      "法拉利BR20",
      "法拉利SP51",
      "法拉利458",
      "法拉利599",
      "法拉利FF",
      "Dino",
      "Enzo",
      "Sergio",
      "SF90",
      "法拉利212",
      "法拉利275",
      "法拉利308",
      "法拉利328",
      "法拉利348",
      "法拉利360",
      "法拉利375",
      "法拉利400",
      "法拉利410",
      "法拉利456",
      "法拉利488",
      "法拉利500",
      "法拉利550",
      "法拉利575M",
      "法拉利612",
      "法拉利812",
      "法拉利F355",
      "法拉利F40",
      "法拉利F430",
      "法拉利F50",
      "法拉利F8",
      "法拉利GTO",
      "法拉利J50",
      "法拉利P80/C",
      "法拉利SP38",
      "法拉利SP3JC"
    ]
  },
  {
    "id": "car-146",
    "name": "福田",
    "models": [
      "时代EV6",
      "祥菱Q EV",
      "祥菱V1 EV",
      "图雅诺大麦",
      "大将军G9SUV",
      "将军F9SUV",
      "祥菱S",
      "祥菱U7",
      "祥菱U8",
      "祥菱M",
      "祥菱M新能源",
      "祥菱V",
      "风景G5",
      "风景G7",
      "风景G9",
      "风景i",
      "钱多多",
      "图雅诺",
      "图雅诺X5",
      "图雅诺X5新能源",
      "图雅诺X8新能源",
      "图雅诺大V",
      "图雅诺大V新能源",
      "图雅诺智蓝新能源",
      "智蓝精灵E7",
      "大将军EV",
      "大将军G7",
      "大将军G9",
      "福田火星",
      "将军F9",
      "将军F9新能源",
      "智蓝精灵E5",
      "福田征服者7",
      "祥菱Q",
      "祥菱V5 EV",
      "拓陆者战途",
      "新一代全尺寸皮卡",
      "迷迪",
      "迷迪新能源",
      "伽途GT",
      "萨瓦纳",
      "伽途im6",
      "伽途im8",
      "风景V3",
      "风景V5",
      "风景V5新能源",
      "伽途ix5",
      "伽途ix7",
      "福田风景",
      "蒙派克E",
      "蒙派克S",
      "福田征服者3",
      "福田征服者5",
      "萨普",
      "拓陆者",
      "拓陆者胜途",
      "拓陆者驭途",
      "风景i9"
    ]
  },
  {
    "id": "car-147",
    "name": "菲亚特",
    "models": [
      "菲亚特600",
      "Titano",
      "Panda",
      "Panda EV",
      "菲亚特500",
      "Argo",
      "菲亚特500L",
      "Cronos",
      "Tipo",
      "菲亚特500X",
      "Fastback",
      "Pulse",
      "Fiorino",
      "多宝",
      "多宝新能源",
      "E-Ulysse",
      "Ducato",
      "Talento",
      "Fullback",
      "Strada",
      "Toro",
      "菲亚特126P",
      "Idea",
      "Mobi",
      "菲亚特Uno",
      "派力奥(海外)",
      "朋多",
      "Sedici",
      "博悦",
      "领雅",
      "菲跃",
      "菲亚特FCC4",
      "Qubo",
      "菲亚特124",
      "菲亚特8V",
      "菲翔",
      "致悦",
      "派朗",
      "派力奥",
      "西耶那",
      "周末风"
    ]
  },
  {
    "id": "car-148",
    "name": "福迪",
    "models": [
      "揽福",
      "探索者Ⅱ",
      "探索者Ⅲ",
      "探索者6",
      "小超人",
      "雄师F16",
      "雄师F22",
      "雄狮"
    ]
  },
  {
    "id": "car-149",
    "name": "飞碟汽车",
    "models": [
      "飞碟EW5",
      "飞碟HV5",
      "飞碟HV6",
      "飞碟U5",
      "飞碟U6",
      "飞碟EF3",
      "飞碟HW5",
      "飞碟Q2T",
      "飞碟Q2V"
    ]
  },
  {
    "id": "car-150",
    "name": "Faraday Future",
    "models": [
      "FFZERO1"
    ]
  },
  {
    "id": "car-151",
    "name": "Fisker",
    "models": [
      "Ronin",
      "Alaska",
      "Ocean",
      "PEAR",
      "EMotion",
      "Karma",
      "Atlantic",
      "Latigo",
      "Surf",
      "Tramonto"
    ]
  },
  {
    "id": "car-152",
    "name": "FOX Automotive",
    "models": [
      "FOX MIA"
    ]
  },
  {
    "id": "car-153",
    "name": "Foxtron",
    "models": [
      "Model E",
      "Model B",
      "Model C",
      "Model D",
      "Model V"
    ]
  },
  {
    "id": "car-154",
    "name": "Frangivento",
    "models": [
      "Sorpasso"
    ]
  },
  {
    "id": "car-155",
    "name": "FREELANDER 神行者",
    "models": [
      "神行者8"
    ]
  },
  {
    "id": "car-156",
    "name": "Fresco",
    "models": [
      "Reverie"
    ]
  },
  {
    "id": "car-157",
    "name": "富古汽车",
    "models": [
      "Summer"
    ]
  },
  {
    "id": "car-158",
    "name": "弗那萨利",
    "models": [
      "弗那萨利 99"
    ]
  },
  {
    "id": "car-159",
    "name": "方程豹",
    "models": [
      "钛3",
      "豹8",
      "豹5",
      "钛7",
      "方程S",
      "SUPER 9"
    ]
  },
  {
    "id": "car-160",
    "name": "法诺新能源",
    "models": [
      "奥赛罗"
    ]
  },
  {
    "id": "car-161",
    "name": "福田卡文汽车",
    "models": [
      "卡文乐途",
      "乐迪",
      "乐福"
    ]
  },
  {
    "id": "car-162",
    "name": "飞翔",
    "models": [
      "飞翔福特舒野"
    ]
  },
  {
    "id": "car-163",
    "name": "广汽集团",
    "models": [
      "ERA纪元",
      "广汽MOCA摩卡",
      "ENO.146",
      "绿境SPACE",
      "绎乐",
      "世锐PHEV",
      "广汽丰田iA5",
      "广汽ix4",
      "T9M",
      "E-more",
      "祺智EV",
      "祺智PHEV"
    ]
  },
  {
    "id": "car-164",
    "name": "观致",
    "models": [
      "观致",
      "观致3",
      "观致3新能源",
      "观致6",
      "观致6新能源",
      "观致9",
      "观致2",
      "观致5",
      "观致5新能源",
      "观致7",
      "观致REV5",
      "观致MILE 1"
    ]
  },
  {
    "id": "car-165",
    "name": "GMC",
    "models": [
      "TERRAIN",
      "ACADIA",
      "CANYON",
      "SIERRA",
      "Granite",
      "Jimmy",
      "ENVOY",
      "Graphyte",
      "SAVANA"
    ]
  },
  {
    "id": "car-166",
    "name": "国机智骏",
    "models": [
      "国机智骏GC1",
      "国机智骏GC2",
      "国机智骏GX5",
      "国机智骏GT3"
    ]
  },
  {
    "id": "car-167",
    "name": "广汽吉奥",
    "models": [
      "E美",
      "奥轩G3",
      "吉奥凯旋",
      "凯睿",
      "帅豹",
      "帅威",
      "奥轩G5",
      "奥轩GX5",
      "广汽吉奥GX6",
      "帅驰",
      "帅舰",
      "星朗",
      "星旺",
      "星旺CL",
      "星旺L",
      "星旺M1",
      "星旺M2",
      "财运100",
      "财运300",
      "财运500"
    ]
  },
  {
    "id": "car-168",
    "name": "国金汽车",
    "models": [
      "国金糖果",
      "骏行",
      "悦驰",
      "国金GM3"
    ]
  },
  {
    "id": "car-169",
    "name": "国吉商用车",
    "models": [
      "大象G30",
      "大象G40"
    ]
  },
  {
    "id": "car-170",
    "name": "GAZ",
    "models": [
      "GAZ-12"
    ]
  },
  {
    "id": "car-171",
    "name": "GFG Style",
    "models": [
      "GFG 2030",
      "Kangaroo"
    ]
  },
  {
    "id": "car-172",
    "name": "Giamaro",
    "models": [
      "Albor",
      "Katla"
    ]
  },
  {
    "id": "car-173",
    "name": "Ginetta",
    "models": [
      "Akula"
    ]
  },
  {
    "id": "car-174",
    "name": "GLM",
    "models": [
      "GLM G4"
    ]
  },
  {
    "id": "car-175",
    "name": "GMA",
    "models": [
      "GMA S1",
      "GMA T.33",
      "GMA T.50",
      "Le Mans"
    ]
  },
  {
    "id": "car-176",
    "name": "GTA",
    "models": [
      "Spano"
    ]
  },
  {
    "id": "car-177",
    "name": "Gumpert",
    "models": [
      "Apollo",
      "Tornante"
    ]
  },
  {
    "id": "car-178",
    "name": "NEVS国能汽车",
    "models": [
      "NEVS 93",
      "Sango"
    ]
  },
  {
    "id": "car-179",
    "name": "光冈",
    "models": [
      "光冈Buddy",
      "女王",
      "大蛇",
      "嘉路"
    ]
  },
  {
    "id": "car-180",
    "name": "广汽昊铂",
    "models": [
      "昊铂HT",
      "昊铂A800",
      "昊铂HL",
      "昊铂SSR",
      "昊铂Earth"
    ]
  },
  {
    "id": "car-181",
    "name": "广通客车",
    "models": [
      "广通艾菲"
    ]
  },
  {
    "id": "car-182",
    "name": "格罗夫",
    "models": [
      "中极天玑",
      "格兰尼",
      "欧思典"
    ]
  },
  {
    "id": "car-183",
    "name": "红旗",
    "models": [
      "红旗H6",
      "红旗EH7",
      "红旗H9",
      "红旗金葵花国礼",
      "红旗HS3",
      "红旗HS5",
      "红旗HS7",
      "红旗天工08",
      "红旗E-HS9",
      "红旗金葵花国耀",
      "红旗HQ9",
      "红旗金葵花国悦",
      "金葵花概念车",
      "红旗越野",
      "红旗E-LS",
      "红旗天辇一号",
      "红旗L6",
      "世纪星",
      "新明仕",
      "红旗H7",
      "红旗盛世",
      "红旗CA770",
      "红旗L7",
      "红旗L9",
      "红旗旗舰",
      "红旗E-HS3",
      "红旗SUV",
      "红旗LS5",
      "红旗E·境",
      "红旗概念雕塑"
    ]
  },
  {
    "id": "car-184",
    "name": "悍马",
    "models": [
      "悍马HX",
      "悍马H3",
      "悍马H1",
      "悍马H2"
    ]
  },
  {
    "id": "car-185",
    "name": "华普",
    "models": [
      "海锋",
      "海尚",
      "海炫",
      "海迅",
      "海域",
      "海悦",
      "华普海景"
    ]
  },
  {
    "id": "car-186",
    "name": "汉龙汽车",
    "models": [
      "汉龙SAGA",
      "旷世"
    ]
  },
  {
    "id": "car-187",
    "name": "Hennessey",
    "models": [
      "Venom F5",
      "Goliath",
      "Maximus",
      "Venom",
      "Venom GT"
    ]
  },
  {
    "id": "car-188",
    "name": "Hispano Suiza",
    "models": [
      "Carmen"
    ]
  },
  {
    "id": "car-189",
    "name": "Hopium",
    "models": [
      "Machina"
    ]
  },
  {
    "id": "car-190",
    "name": "华东汽车",
    "models": [
      "华东牌商务车"
    ]
  },
  {
    "id": "car-191",
    "name": "华凯",
    "models": [
      "华凯新能源",
      "华凯VB06",
      "华凯皮卡"
    ]
  },
  {
    "id": "car-192",
    "name": "华晨新日",
    "models": [
      "华晨新日i03",
      "华晨新日i03A"
    ]
  },
  {
    "id": "car-193",
    "name": "华梓汽车",
    "models": [
      "欧麦加",
      "华梓凌特",
      "华梓1号"
    ]
  },
  {
    "id": "car-194",
    "name": "华泰",
    "models": [
      "路盛E70",
      "路盛E80",
      "华泰B11",
      "路盛E90",
      "宝利格",
      "圣达菲",
      "圣达菲5",
      "圣达菲7",
      "圣达菲经典",
      "特拉卡"
    ]
  },
  {
    "id": "car-195",
    "name": "华泰新能源",
    "models": [
      "华泰EV160B",
      "华泰EV160R",
      "路盛S1",
      "华泰iEV230",
      "路盛S5",
      "圣达菲2",
      "华泰XEV260",
      "圣达菲5新能源",
      "圣达菲7新能源",
      "圣达菲新能源"
    ]
  },
  {
    "id": "car-196",
    "name": "华颂",
    "models": [
      "华颂7"
    ]
  },
  {
    "id": "car-197",
    "name": "华骐",
    "models": [
      "HORKI-1",
      "华骐300E"
    ]
  },
  {
    "id": "car-198",
    "name": "合创汽车",
    "models": [
      "合创Ar18",
      "合创A06",
      "合创Z03",
      "合创007",
      "合创V09"
    ]
  },
  {
    "id": "car-199",
    "name": "哈飞",
    "models": [
      "路宝",
      "赛马",
      "赛豹III",
      "赛豹V",
      "哈飞小霸王",
      "骏意",
      "路尊大霸王",
      "民意",
      "中意V5",
      "民意微卡"
    ]
  },
  {
    "id": "car-200",
    "name": "宏远汽车",
    "models": [
      "宏远EM60"
    ]
  },
  {
    "id": "car-201",
    "name": "恒信致远",
    "models": [
      "恒信致远V级",
      "恒信致远威霆"
    ]
  },
  {
    "id": "car-202",
    "name": "恒天",
    "models": [
      "恒天L4600",
      "欢腾H1",
      "恒好EV1",
      "恒好EV7",
      "途腾T1",
      "途腾T2",
      "途腾T3"
    ]
  },
  {
    "id": "car-203",
    "name": "恒润汽车",
    "models": [
      "恒润H23",
      "恒润HRS1"
    ]
  },
  {
    "id": "car-204",
    "name": "恒驰",
    "models": [
      "恒驰2",
      "恒驰7",
      "恒驰8",
      "恒驰1",
      "恒驰6",
      "恒驰9",
      "恒驰3",
      "恒驰4",
      "恒驰5"
    ]
  },
  {
    "id": "car-205",
    "name": "汇天",
    "models": [
      "汇天飞行汽车",
      "汇天旅航者X2"
    ]
  },
  {
    "id": "car-206",
    "name": "汉腾汽车",
    "models": [
      "幸福e+",
      "汉腾RED 01",
      "汉腾X5",
      "汉腾X5新能源",
      "汉腾X7",
      "汉腾X7新能源",
      "汉腾X8",
      "汉腾V7"
    ]
  },
  {
    "id": "car-207",
    "name": "海格",
    "models": [
      "海格H6C",
      "海格H4E",
      "海格H5C",
      "海格H5V",
      "海格H6V",
      "海格H7V",
      "龙威",
      "御骏"
    ]
  },
  {
    "id": "car-208",
    "name": "红星汽车",
    "models": [
      "闪闪X2"
    ]
  },
  {
    "id": "car-209",
    "name": "赫菲特汽车",
    "models": [
      "赫菲特途睿欧",
      "赫菲特高顶赛那",
      "沃尔法海狮"
    ]
  },
  {
    "id": "car-210",
    "name": "黄海",
    "models": [
      "黄海蛟龙",
      "黄海蛟龙新能源",
      "黄海威龙",
      "黄海翔龙",
      "黄海·大牛",
      "黄海·野牛",
      "Smile",
      "翱龙CUV",
      "旗胜F1",
      "旗胜V3",
      "挑战者SUV",
      "瑞途",
      "瑞途新能源",
      "傲骏",
      "大柴神",
      "黄海·小牛",
      "黄海N3",
      "小柴神"
    ]
  },
  {
    "id": "car-211",
    "name": "iCAR",
    "models": [
      "iCAR V27",
      "iCAR X25",
      "iCAR GT",
      "iCAR 03",
      "iCAR 03T"
    ]
  },
  {
    "id": "car-212",
    "name": "Icona",
    "models": [
      "NEO",
      "Nucleus",
      "Vulcano"
    ]
  },
  {
    "id": "car-213",
    "name": "IED",
    "models": [
      "Tracy"
    ]
  },
  {
    "id": "car-214",
    "name": "INDI",
    "models": [
      "INDI One"
    ]
  },
  {
    "id": "car-215",
    "name": "Inferno",
    "models": [
      "Inferno"
    ]
  },
  {
    "id": "car-216",
    "name": "Italdesign",
    "models": [
      "Climb-E",
      "DaVinci",
      "GT ZERO",
      "Zerouno"
    ]
  },
  {
    "id": "car-217",
    "name": "极氪",
    "models": [
      "极氪001 FR",
      "极氪X",
      "极氪7X",
      "极氪9X",
      "极氪MIX",
      "极氪009",
      "M-Vision"
    ]
  },
  {
    "id": "car-218",
    "name": "捷豹",
    "models": [
      "捷豹XEL",
      "捷豹XFL",
      "捷豹E-PACE",
      "捷豹XF",
      "捷豹F-PACE",
      "捷豹C-TYPE",
      "捷豹E-TYPE",
      "捷豹F-TYPE",
      "捷豹B99",
      "捷豹XE",
      "捷豹X-TYPE",
      "捷豹S-TYPE",
      "捷豹XJ",
      "捷豹I-PACE",
      "捷豹C-X16",
      "捷豹C-X75",
      "捷豹D-TYPE",
      "捷豹SS100",
      "捷豹XJ220",
      "捷豹XK"
    ]
  },
  {
    "id": "car-219",
    "name": "Jeep",
    "models": [
      "北京JEEP",
      "大切诺基",
      "自由侠",
      "指南者",
      "指南者新能源",
      "大指挥官",
      "大指挥官PHEV",
      "云图",
      "指挥官",
      "指挥官PHEV",
      "自由光",
      "牧马人新能源",
      "角斗士",
      "Avenger",
      "Jeepster",
      "自由侠(海外)",
      "自由侠新能源",
      "CJ Surge",
      "Recon",
      "指南者(进口)",
      "自由光(进口)",
      "大切诺基(进口)",
      "Wagoneer",
      "自由客",
      "Chief",
      "切诺基(进口)",
      "自由人",
      "指挥官经典",
      "Jeep J12",
      "大切诺基 SRT"
    ]
  },
  {
    "id": "car-220",
    "name": "捷途",
    "models": [
      "捷途旅行",
      "捷途自由者",
      "捷途X70",
      "捷途X70L",
      "捷途X90",
      "捷途X95",
      "捷途X",
      "捷途环游者",
      "捷途自由者7",
      "捷途旅行者8",
      "捷途T-3",
      "捷途大圣i-DM",
      "捷途X70EV",
      "捷途X70M",
      "捷途X70S"
    ]
  },
  {
    "id": "car-221",
    "name": "江汽集团",
    "models": [
      "恺达EX6",
      "江淮T6 EV",
      "江淮征程",
      "恺达X5新能源",
      "江淮iEV7",
      "江淮iEVA50",
      "Van宝路",
      "蓝猫",
      "多米EV1",
      "江淮卡拉",
      "江淮征程EV",
      "恺达U7",
      "星锐",
      "星锐EV",
      "江淮T8新能源",
      "江淮V7",
      "LSEV",
      "江淮iEV6E",
      "愿景IV",
      "悦悦",
      "和悦A13",
      "和悦A13RS",
      "和悦A20",
      "和悦A30",
      "江淮iEV",
      "瑞风A33",
      "同悦",
      "同悦RS",
      "和悦",
      "和悦A60",
      "嘉悦A5",
      "江淮iC5",
      "宾悦",
      "江淮iEVA60",
      "江淮iEV7C",
      "瑞风A60",
      "愿景III",
      "嘉悦X4",
      "江淮iEV6S",
      "江淮iEV7E",
      "江淮iEV7S",
      "江淮iEVS4",
      "瑞风S2",
      "瑞风S2mini",
      "瑞风S3",
      "瑞风S4",
      "瑞风S5",
      "瑞风S7",
      "瑞鹰",
      "嘉悦X7",
      "江淮SC-5",
      "瑞风SC-9",
      "瑞风M2",
      "瑞风R3",
      "瑞风M6",
      "瑞风M5",
      "和悦SC",
      "凌铃",
      "瑞风",
      "江淮4R3皮卡",
      "江淮K3",
      "江淮K5",
      "瑞驰II",
      "瑞铃",
      "征途"
    ]
  },
  {
    "id": "car-222",
    "name": "吉利几何",
    "models": [
      "吉利几何A",
      "吉利几何G6",
      "吉利几何E萤火虫",
      "吉利几何M6",
      "吉利几何T",
      "EX3 功夫牛",
      "吉利几何C"
    ]
  },
  {
    "id": "car-223",
    "name": "江铃",
    "models": [
      "凯锐EV",
      "顺达EV",
      "域虎9多功能车",
      "江铃凯运",
      "顺达",
      "E福顺小卡",
      "E福顺",
      "E路顺V6",
      "江铃福顺",
      "宝典",
      "大道EV",
      "域虎",
      "域虎7",
      "域虎9",
      "域虎EV",
      "特顺EV",
      "驭胜S330",
      "宝威",
      "驭胜S350",
      "E路顺",
      "特顺",
      "域虎3",
      "域虎5"
    ]
  },
  {
    "id": "car-224",
    "name": "捷达",
    "models": [
      "捷达VA3",
      "捷达VA7",
      "捷达VS5",
      "捷达VS7",
      "JETTA M6",
      "JETTA X"
    ]
  },
  {
    "id": "car-225",
    "name": "Polestar极星",
    "models": [
      "Synergy"
    ]
  },
  {
    "id": "car-226",
    "name": "捷尼赛思",
    "models": [
      "捷尼赛思GV90",
      "捷尼赛思G80",
      "捷尼赛思G90",
      "捷尼赛思GV70",
      "捷尼赛思GV80",
      "捷尼赛思GV60",
      "GMR-001",
      "Mint",
      "捷尼赛思G70"
    ]
  },
  {
    "id": "car-227",
    "name": "ARCFOX极狐",
    "models": [
      "极狐 阿尔法S5",
      "问道V9",
      "极狐T1",
      "极狐 阿尔法S6",
      "极狐 考拉S",
      "极狐 阿尔法T6",
      "极狐 考拉",
      "极狐 阿尔法S",
      "极狐 阿尔法T",
      "元境智舱X",
      "极狐N50AB",
      "极狐 77°",
      "ARCFOX-1",
      "ARCFOX-7"
    ]
  },
  {
    "id": "car-228",
    "name": "钧天",
    "models": [
      "钧天勇猛者",
      "钧天格瑞维亚",
      "钧天纵横家",
      "大道 沐光",
      "钧天霸界"
    ]
  },
  {
    "id": "car-229",
    "name": "吉利雷达",
    "models": [
      "吉利雷达地平线"
    ]
  },
  {
    "id": "car-230",
    "name": "江铃集团新能源",
    "models": [
      "颐驰06",
      "易至EV3",
      "羿驰05",
      "羿驰05S",
      "羿驰01",
      "江铃E100B",
      "江铃E200L",
      "江铃E200N",
      "江铃E160",
      "易至EX5",
      "易至EV2",
      "羿"
    ]
  },
  {
    "id": "car-231",
    "name": "金龙",
    "models": [
      "龙耀5",
      "龙耀6S",
      "金龙V8",
      "龙耀6",
      "金威",
      "凯歌",
      "凯歌新能源",
      "凯锐浩克",
      "龙耀8",
      "龙耀8L",
      "龙耀8S",
      "浩锐",
      "凯特"
    ]
  },
  {
    "id": "car-232",
    "name": "江铃晶马汽车",
    "models": [
      "E路福",
      "福运",
      "福运新能源"
    ]
  },
  {
    "id": "car-233",
    "name": "极越",
    "models": [
      "极越07",
      "极越01",
      "极越Robo X"
    ]
  },
  {
    "id": "car-234",
    "name": "江南汽车",
    "models": [
      "江南U2"
    ]
  },
  {
    "id": "car-235",
    "name": "金冠汽车",
    "models": [
      "金冠V级",
      "宾歌T10",
      "金冠G20"
    ]
  },
  {
    "id": "car-236",
    "name": "金旅",
    "models": [
      "海狮Z系列",
      "金旅大海狮",
      "金旅海狮",
      "金旅海狮新能源",
      "领特",
      "领特新能源",
      "金旅大海狮新能源",
      "金旅考斯特",
      "新时代海狮"
    ]
  },
  {
    "id": "car-237",
    "name": "ROX极石",
    "models": [
      "极石01"
    ]
  },
  {
    "id": "car-238",
    "name": "九龙",
    "models": [
      "九龙EM3",
      "九龙A4",
      "九龙A5",
      "九龙A6",
      "九龙C6",
      "九龙EW5",
      "九龙W5",
      "九龙EM5",
      "开鹿V3",
      "艾菲",
      "艾菲新能源",
      "大MPV",
      "考斯特"
    ]
  },
  {
    "id": "car-239",
    "name": "佳跃",
    "models": [
      "佳跃"
    ]
  },
  {
    "id": "car-240",
    "name": "吉利银河",
    "models": [
      "翼真L380",
      "熊猫",
      "星愿",
      "银河L6",
      "银河E8",
      "银河E5",
      "银河L7",
      "银河星舰7",
      "银河E6",
      "银河之光",
      "银河L5",
      "银河E7"
    ]
  },
  {
    "id": "car-241",
    "name": "吉祥汽车",
    "models": [
      "吉祥AIR"
    ]
  },
  {
    "id": "car-242",
    "name": "君马汽车",
    "models": [
      "君马MEET 5",
      "君马S70"
    ]
  },
  {
    "id": "car-243",
    "name": "奇点汽车",
    "models": [
      "奇点iC3",
      "奇点iS6"
    ]
  },
  {
    "id": "car-244",
    "name": "巨威房车",
    "models": [
      "一汽解放虎6G",
      "福特大额头房车",
      "奔驰Atego",
      "汕德卡",
      "五十铃700P",
      "一汽解放·雪鹰",
      "巨威房车 依维柯",
      "奔驰乌尼莫克"
    ]
  },
  {
    "id": "car-245",
    "name": "捷途山海",
    "models": [
      "捷途山海T1",
      "捷途山海L9",
      "捷途山海L6",
      "捷途山海L7",
      "捷途山海L10",
      "捷途山海T5"
    ]
  },
  {
    "id": "car-246",
    "name": "旌航房车",
    "models": [
      "得意A35",
      "五菱系列房车",
      "伊卡洛斯",
      "NEXT ONE",
      "福特T8",
      "巍浩系列",
      "未来",
      "骁龙",
      "远行者",
      "奔驰517",
      "福特F350"
    ]
  },
  {
    "id": "car-247",
    "name": "景飞汽车",
    "models": [
      "途瑞欧雅典纳",
      "景飞牌GT670",
      "景飞牌M50",
      "F-150旅居车",
      "景飞牌212"
    ]
  },
  {
    "id": "car-248",
    "name": "江淮钇为",
    "models": [
      "钇为花仙子",
      "钇为3",
      "爱跑"
    ]
  },
  {
    "id": "car-249",
    "name": "江铃集团房车",
    "models": [
      "小野牛",
      "江铃福特B型房车",
      "大海牛",
      "福犀牛"
    ]
  },
  {
    "id": "car-250",
    "name": "金琥新能源",
    "models": [
      "金琥ET50",
      "金琥EV48",
      "金琥EV70"
    ]
  },
  {
    "id": "car-251",
    "name": "金龙礼宾",
    "models": [
      "迈凯宾 量子方舟"
    ]
  },
  {
    "id": "car-252",
    "name": "骏驰",
    "models": [
      "骏驰EA",
      "骏驰EK",
      "骏驰ET"
    ]
  },
  {
    "id": "car-253",
    "name": "凯迪拉克",
    "models": [
      "IQ傲歌",
      "凯迪拉克CT4",
      "凯迪拉克CT5",
      "凯迪拉克CT6",
      "凯迪拉克GT4",
      "凯迪拉克XT4",
      "凯迪拉克XT5",
      "IQ锐歌",
      "凯迪拉克XT6",
      "SLS赛威",
      "凯迪拉克CTS",
      "凯迪拉克XTS",
      "Sollei",
      "Brougham",
      "IQ傲歌(进口)",
      "IQ锐歌(海外)",
      "凯迪拉克BLS",
      "Seville",
      "凯迪拉克STS",
      "Ciel",
      "DeVille",
      "Escala",
      "弗雷特伍德",
      "凯迪拉克SRX",
      "凯迪拉克EV",
      "Converj",
      "Elmiraj",
      "凯迪拉克ELR",
      "凯迪拉克XLR"
    ]
  },
  {
    "id": "car-254",
    "name": "克蒂汽车",
    "models": [
      "克蒂怪兽",
      "克蒂WALD",
      "克蒂巴赫",
      "克蒂帝亚",
      "克蒂昆仑",
      "克蒂山川",
      "克蒂圣姆峰",
      "克蒂翔翼",
      "克蒂雪堆白",
      "克蒂GLS",
      "克蒂巴赫(进口)"
    ]
  },
  {
    "id": "car-255",
    "name": "克慕勒",
    "models": [
      "克慕勒GLS",
      "克慕勒GT系列",
      "克慕勒M系列"
    ]
  },
  {
    "id": "car-256",
    "name": "克莱斯勒",
    "models": [
      "铂锐",
      "克莱斯勒300C",
      "大捷龙",
      "Airflow",
      "Halcyon",
      "克莱斯勒300",
      "大捷龙(进口)",
      "PT 漫步者",
      "Sebring",
      "克莱斯勒200",
      "克莱斯勒200C",
      "Aspen",
      "Portal",
      "克莱斯勒700C",
      "交叉火力",
      "猎兽"
    ]
  },
  {
    "id": "car-257",
    "name": "焜驰",
    "models": [
      "宸辉VL900",
      "焜驰威霆"
    ]
  },
  {
    "id": "car-258",
    "name": "KTM",
    "models": [
      "X-BOW"
    ]
  },
  {
    "id": "car-259",
    "name": "卡威",
    "models": [
      "卡威E20",
      "卡威EV1",
      "卡威SUV",
      "卡威W1",
      "路易斯",
      "卡威E10",
      "卡威EV7",
      "卡威K1",
      "卡威K150",
      "卡威K150GT"
    ]
  },
  {
    "id": "car-260",
    "name": "开瑞",
    "models": [
      "江豚",
      "江豚E5",
      "江豚E6",
      "江豚E7",
      "开瑞X6",
      "小象EV",
      "小象S卡EV",
      "小象X3",
      "小象X5",
      "小象X7",
      "优劲EV",
      "优劲T5",
      "优劲",
      "优越",
      "开瑞EK1",
      "开瑞K60",
      "开瑞K60EV",
      "开瑞X70",
      "开瑞K50",
      "开瑞K50EV",
      "小猬EV",
      "优翼",
      "优派",
      "优胜",
      "优胜2代",
      "优雅",
      "优雅2代",
      "优优",
      "优优2代",
      "优优EV",
      "杰虎"
    ]
  },
  {
    "id": "car-261",
    "name": "科尼赛克",
    "models": [
      "Gemera",
      "Jesko",
      "Regera",
      "Agera",
      "One:1",
      "科尼赛克CCR",
      "科尼赛克CCX",
      "科尼赛克CCXR"
    ]
  },
  {
    "id": "car-262",
    "name": "Karma",
    "models": [
      "Kaveya",
      "GS-6",
      "Gyesera",
      "Revero",
      "Ivara"
    ]
  },
  {
    "id": "car-263",
    "name": "KHANN",
    "models": [
      "KHANN凯美瑞"
    ]
  },
  {
    "id": "car-264",
    "name": "凯佰赫",
    "models": [
      "战盾"
    ]
  },
  {
    "id": "car-265",
    "name": "凯马",
    "models": [
      "骏航EV",
      "凯马锐腾",
      "锐航",
      "锐菱",
      "骏航ES",
      "锐捷"
    ]
  },
  {
    "id": "car-266",
    "name": "卡升",
    "models": [
      "卡升威霆",
      "卡升C10",
      "卡升T6"
    ]
  },
  {
    "id": "car-267",
    "name": "卡尔森",
    "models": [
      "卡尔森 C级",
      "卡尔森 CLS",
      "卡尔森 S级",
      "卡尔森 M级",
      "卡尔森 GLS",
      "卡尔森 GL级",
      "卡尔森 C25"
    ]
  },
  {
    "id": "car-268",
    "name": "卡驰汽车",
    "models": [
      "莎尔法"
    ]
  },
  {
    "id": "car-269",
    "name": "康派斯",
    "models": [
      "康派斯B型房车"
    ]
  },
  {
    "id": "car-270",
    "name": "开利",
    "models": [
      "开利"
    ]
  },
  {
    "id": "car-271",
    "name": "开沃汽车",
    "models": [
      "开沃K15",
      "开沃D07L",
      "开沃D07创业者",
      "开沃D08",
      "开沃K10",
      "开沃K10L",
      "开沃D09",
      "开沃D10",
      "开沃D11"
    ]
  },
  {
    "id": "car-272",
    "name": "魁士",
    "models": [
      "睿吉馬Vito",
      "睿吉馬V级"
    ]
  },
  {
    "id": "car-273",
    "name": "零跑汽车",
    "models": [
      "零跑C10",
      "零跑T03",
      "零跑B01",
      "零跑B10",
      "零跑C11",
      "零跑C16",
      "零跑C01",
      "零跑S01"
    ]
  },
  {
    "id": "car-274",
    "name": "雷克萨斯",
    "models": [
      "雷克萨斯LBX",
      "雷克萨斯LS",
      "雷克萨斯NX",
      "雷克萨斯RZ",
      "雷克萨斯GX",
      "雷克萨斯RX",
      "雷克萨斯LX",
      "雷克萨斯LM",
      "雷克萨斯LC",
      "雷克萨斯UX",
      "雷克萨斯IS",
      "雷克萨斯TX",
      "雷克萨斯TZ",
      "雷克萨斯RC",
      "雷克萨斯CT",
      "雷克萨斯HS",
      "雷克萨斯GS",
      "LS概念车",
      "雷克萨斯RX经典",
      "雷克萨斯SC",
      "雷克萨斯RC F",
      "雷克萨斯IS F",
      "雷克萨斯GS F",
      "雷克萨斯LC F",
      "雷克萨斯LFA"
    ]
  },
  {
    "id": "car-275",
    "name": "理想汽车",
    "models": [
      "理想i6",
      "理想i8",
      "理想L6",
      "理想L7",
      "理想L8",
      "理想MEGA",
      "理想轿车",
      "理想ONE"
    ]
  },
  {
    "id": "car-276",
    "name": "路虎",
    "models": [
      "路虎纯电SUV",
      "揽胜星脉",
      "揽胜运动",
      "路虎卫士",
      "发现运动(进口)",
      "揽胜极光(进口)",
      "揽胜星脉新能源",
      "揽胜新能源",
      "揽胜运动新能源",
      "路虎DC100",
      "神行者2",
      "Series I",
      "发现神行(进口)",
      "神行者",
      "路虎卫士新能源",
      "揽胜极光",
      "发现神行",
      "发现运动",
      "发现运动新能源",
      "揽胜极光新能源"
    ]
  },
  {
    "id": "car-277",
    "name": "岚图汽车",
    "models": [
      "岚图追光 L",
      "岚图FREE",
      "岚图泰山",
      "岚图追光",
      "ICOZY",
      "岚图iLand"
    ]
  },
  {
    "id": "car-278",
    "name": "领克",
    "models": [
      "领克03",
      "领克10",
      "领克Z10",
      "领克06",
      "领克01",
      "领克05",
      "领克Z20",
      "领克09",
      "领克GT",
      "领克03新能源",
      "LYNK概念车",
      "01概念车",
      "领克02",
      "领克02新能源"
    ]
  },
  {
    "id": "car-279",
    "name": "林肯",
    "models": [
      "林肯Z",
      "飞行家",
      "冒险家新能源",
      "领航员",
      "冒险家(海外)",
      "航海家(进口)",
      "飞行家(进口)",
      "林肯Star",
      "林肯C",
      "林肯MKZ",
      "林肯LS",
      "林肯MKS",
      "林肯大陆",
      "Model K",
      "Model L",
      "城市",
      "林肯MKC",
      "林肯MKX",
      "林肯MKT",
      "领航员壹号"
    ]
  },
  {
    "id": "car-280",
    "name": "乐道",
    "models": [
      "乐道L60",
      "乐道纯电轿车"
    ]
  },
  {
    "id": "car-281",
    "name": "劳斯莱斯",
    "models": [
      "逐影",
      "幻影",
      "古思特",
      "库里南",
      "闪灵",
      "浮影",
      "魅影",
      "幻影新能源",
      "劳斯莱斯银影",
      "慧影",
      "曜影"
    ]
  },
  {
    "id": "car-282",
    "name": "领汇",
    "models": [
      "领汇M9"
    ]
  },
  {
    "id": "car-283",
    "name": "莲花跑车",
    "models": [
      "EMEYA",
      "ELETRE",
      "EMIRA",
      "EVIJA",
      "E-R9",
      "Theory 1",
      "3-Eleven",
      "Elan",
      "Elise",
      "Elite",
      "Esprit",
      "Eterne",
      "Europa",
      "Evora",
      "Excel",
      "Exige"
    ]
  },
  {
    "id": "car-284",
    "name": "兰博基尼",
    "models": [
      "Lanzador",
      "Urus",
      "Urus SE",
      "Huracán",
      "Revuelto",
      "Countach",
      "Fenomeno",
      "Sián",
      "Asterion",
      "Diablo",
      "Egoista",
      "Estoque",
      "Gallardo",
      "Jalpa",
      "Reventon",
      "Veneno"
    ]
  },
  {
    "id": "car-285",
    "name": "蓝电",
    "models": [
      "蓝电E3",
      "蓝电E5"
    ]
  },
  {
    "id": "car-286",
    "name": "Lorinser罗伦士",
    "models": [
      "格瑞维亚高定"
    ]
  },
  {
    "id": "car-287",
    "name": "拉帝",
    "models": [
      "拉帝"
    ]
  },
  {
    "id": "car-288",
    "name": "灵悉",
    "models": [
      "灵悉L"
    ]
  },
  {
    "id": "car-289",
    "name": "雷丁",
    "models": [
      "雷丁芒果Pro",
      "雷丁A30",
      "雷丁D50",
      "雷丁i3",
      "雷丁芒果",
      "雷丁芒果Max",
      "雷丁E60",
      "雷丁i5",
      "雷丁V60",
      "雷丁i9"
    ]
  },
  {
    "id": "car-290",
    "name": "雷诺",
    "models": [
      "Rafale",
      "Niagara",
      "雷诺QM6",
      "Twingo",
      "Twizy",
      "雷诺5",
      "Clio",
      "Symbol",
      "雷诺4 Luxe",
      "雷诺Logan",
      "雷诺ZOE",
      "Kwid",
      "Sandero",
      "Triber",
      "雷诺R17",
      "梅甘娜",
      "梅甘娜新能源",
      "塔利斯曼",
      "KIGER",
      "卡缤",
      "雷诺 4EVER",
      "SYMBIOZ",
      "风景",
      "科雷傲(进口)",
      "科雷嘉(海外)",
      "雷诺Boreal",
      "雷诺Duster",
      "Espace",
      "MORPHOZ",
      "Kangoo",
      "雷诺Lodgy",
      "Trafic",
      "MASTER",
      "Alaskan",
      "Twin-Run",
      "Twin-Z",
      "雷诺XBA",
      "Eolab",
      "EZ-GO",
      "风朗",
      "拉古那",
      "纬度",
      "威赛帝",
      "EZ-PRO",
      "Frendzy",
      "R-Space",
      "风景经典",
      "Espace经典",
      "Initiale",
      "DeZir",
      "TREZOR",
      "Wind",
      "科雷缤",
      "雷诺 e诺",
      "ARKANA",
      "科雷傲",
      "科雷嘉"
    ]
  },
  {
    "id": "car-291",
    "name": "Lepas",
    "models": [
      "Lepas L4"
    ]
  },
  {
    "id": "car-292",
    "name": "LeSEE",
    "models": [
      "LeSEE"
    ]
  },
  {
    "id": "car-293",
    "name": "LEVC",
    "models": [
      "LEVC TX",
      "LEVC LX",
      "LEVC LCV"
    ]
  },
  {
    "id": "car-294",
    "name": "LIMGENE凌际",
    "models": [
      "凌际威途系列",
      "凌际卫士见山系列",
      "凌际星云系列"
    ]
  },
  {
    "id": "car-295",
    "name": "LITE",
    "models": [
      "LITE"
    ]
  },
  {
    "id": "car-296",
    "name": "LIUX",
    "models": [
      "Animal"
    ]
  },
  {
    "id": "car-297",
    "name": "Lucid",
    "models": [
      "Gravity"
    ]
  },
  {
    "id": "car-298",
    "name": "凌宝汽车",
    "models": [
      "凌宝BOX",
      "凌宝COCO",
      "凌宝uni",
      "凌宝MC11"
    ]
  },
  {
    "id": "car-299",
    "name": "力帆汽车",
    "models": [
      "乐途",
      "力帆320",
      "力帆330",
      "力帆330EV",
      "力帆530",
      "力帆520",
      "力帆620",
      "力帆620EV",
      "力帆630",
      "力帆650",
      "力帆650EV",
      "力帆720",
      "力帆820",
      "力帆820EV",
      "力帆X40",
      "力帆X50",
      "力帆X60",
      "力帆X70",
      "力帆X70概念车",
      "迈威",
      "迈威新能源",
      "力帆X80",
      "力帆枫叶80v",
      "轩朗",
      "轩朗新能源",
      "丰顺",
      "力帆福顺",
      "兴顺",
      "力帆T11",
      "力帆T21"
    ]
  },
  {
    "id": "car-300",
    "name": "拉共达",
    "models": [
      "新境"
    ]
  },
  {
    "id": "car-301",
    "name": "拉达",
    "models": [
      "Granta",
      "XRAY",
      "拉达Niva",
      "Vesta",
      "XCODE"
    ]
  },
  {
    "id": "car-302",
    "name": "朗世",
    "models": [
      "朗世",
      "RF-EA1",
      "RF-EA2"
    ]
  },
  {
    "id": "car-303",
    "name": "猎豹汽车",
    "models": [
      "欧酷曼",
      "飞腾",
      "飞腾C3",
      "猎豹CS7",
      "猎豹CS9",
      "猎豹CS9新能源",
      "Mattu",
      "缤歌",
      "飞腾C5",
      "猎豹C5EV",
      "猎豹Coupe",
      "猎豹CS10",
      "黑金刚",
      "猎豹6481",
      "猎豹CS6",
      "猎豹Q6",
      "骐菱",
      "飞铃",
      "飞扬",
      "猎豹CT5",
      "猎豹CT7"
    ]
  },
  {
    "id": "car-304",
    "name": "珑致",
    "models": [
      "珑致G20金骑士"
    ]
  },
  {
    "id": "car-305",
    "name": "理念",
    "models": [
      "理念S1",
      "广汽本田VE-1"
    ]
  },
  {
    "id": "car-306",
    "name": "礼骊汽车",
    "models": [
      "礼骊汽车V级",
      "礼骊汽车威霆"
    ]
  },
  {
    "id": "car-307",
    "name": "绿驰",
    "models": [
      "天王星",
      "金星",
      "绿驰M500"
    ]
  },
  {
    "id": "car-308",
    "name": "莱茵汽车",
    "models": [
      "莱茵旅行者"
    ]
  },
  {
    "id": "car-309",
    "name": "莲花汽车",
    "models": [
      "竞速",
      "竞悦",
      "莲花L3",
      "莲花L5",
      "莲花L6",
      "莲花T5",
      "莲花Europa"
    ]
  },
  {
    "id": "car-310",
    "name": "菱势汽车",
    "models": [
      "菱势黄金仓",
      "菱势黄金卡",
      "菱势7S",
      "菱势EV50",
      "予风EV50",
      "菱势电卡",
      "菱势黄金小卡"
    ]
  },
  {
    "id": "car-311",
    "name": "蓝擎汽车",
    "models": [
      "凌R",
      "悦ER"
    ]
  },
  {
    "id": "car-312",
    "name": "蓝旗亚",
    "models": [
      "Ypsilon",
      "蓝旗亚Delta",
      "Thema",
      "Voyager",
      "Flavia",
      "Stratos"
    ]
  },
  {
    "id": "car-313",
    "name": "陆地方舟",
    "models": [
      "艾威",
      "陆地方舟风尚",
      "劲玛",
      "陆地方舟V5",
      "威途X35"
    ]
  },
  {
    "id": "car-314",
    "name": "陆风",
    "models": [
      "风华",
      "陆风X2",
      "陆风X5",
      "陆风X6",
      "陆风X7",
      "陆风X8",
      "陆风X9",
      "陆风荣曜",
      "陆风逍遥",
      "风尚"
    ]
  },
  {
    "id": "car-315",
    "name": "雷诺三星",
    "models": [
      "雷诺三星SM6",
      "雷诺三星QM6",
      "雷诺三星XM3"
    ]
  },
  {
    "id": "car-316",
    "name": "雷驰汽车",
    "models": [
      "雷驰·仁T10",
      "雷驰·仁T30",
      "雷驰·信V70",
      "雷驰T30"
    ]
  },
  {
    "id": "car-317",
    "name": "领志",
    "models": [
      "领志i1"
    ]
  },
  {
    "id": "car-318",
    "name": "领途汽车",
    "models": [
      "缤纷",
      "Alumi",
      "领途BX100",
      "领途C3",
      "领途E骋",
      "领途E行",
      "领途S3",
      "领途C5",
      "领途K-ONE",
      "领途S5都市版",
      "领途E-M8",
      "领途M8"
    ]
  },
  {
    "id": "car-319",
    "name": "龙程汽车",
    "models": [
      "龙程众骄VITO"
    ]
  },
  {
    "id": "car-320",
    "name": "玛莎拉蒂",
    "models": [
      "Levante",
      "玛莎拉蒂MC20",
      "MCXtrema",
      "Mostro",
      "Ghibli",
      "总裁",
      "Alfieri",
      "Coupe",
      "玛莎拉蒂MC12"
    ]
  },
  {
    "id": "car-321",
    "name": "MINI",
    "models": [
      "MINI",
      "MINI VAN",
      "MINI JCW"
    ]
  },
  {
    "id": "car-322",
    "name": "迈凯伦",
    "models": [
      "迈凯伦750S",
      "Artura",
      "迈凯伦GT",
      "迈凯伦P1",
      "Sabre",
      "迈凯伦620R",
      "迈凯伦765LT",
      "迈凯伦Elva",
      "迈凯伦GTS",
      "迈凯伦W1",
      "迈凯伦塞纳",
      "迈凯伦12C",
      "迈凯伦500S",
      "迈凯伦540C",
      "迈凯伦570",
      "迈凯伦600LT",
      "迈凯伦625C",
      "迈凯伦650S",
      "迈凯伦675LT",
      "迈凯伦720S",
      "迈凯伦F1",
      "迈凯伦P15",
      "迈凯伦X-1"
    ]
  },
  {
    "id": "car-323",
    "name": "迈莎锐",
    "models": [
      "迈莎锐烈马",
      "迈莎锐G级",
      "迈莎锐添越",
      "迈莎锐GLS",
      "迈莎锐库里南",
      "迈莎锐V级",
      "迈莎锐国悦",
      "迈莎锐RS 6",
      "迈莎锐S级",
      "迈莎锐古思特",
      "迈莎锐幻影",
      "迈莎锐迈巴赫S级",
      "迈莎锐DBX",
      "迈莎锐Urus",
      "迈莎锐奔驰GLE",
      "迈莎锐揽胜",
      "迈莎锐卫士",
      "迈莎锐9X",
      "迈莎锐福特GT",
      "迈莎锐闪灵",
      "迈莎锐MS580",
      "迈莎锐法拉利F8",
      "迈莎锐曜影"
    ]
  },
  {
    "id": "car-324",
    "name": "摩根",
    "models": [
      "摩根Aero",
      "摩根EV3",
      "摩根Plus 4",
      "摩根Plus 6",
      "摩根Plus 8",
      "摩根4-4",
      "摩根Aero 8"
    ]
  },
  {
    "id": "car-325",
    "name": "迈巴赫",
    "models": [
      "迈巴赫",
      "Exelero"
    ]
  },
  {
    "id": "car-326",
    "name": "摩登汽车",
    "models": [
      "摩登汽车MD12"
    ]
  },
  {
    "id": "car-327",
    "name": "敏安汽车",
    "models": [
      "敏微ET1",
      "敏安MX-6"
    ]
  },
  {
    "id": "car-328",
    "name": "迈迈",
    "models": [
      "迈迈"
    ]
  },
  {
    "id": "car-329",
    "name": "Mahindra",
    "models": [
      "BE 6e",
      "Roxor",
      "XEV 9e",
      "KUV 100"
    ]
  },
  {
    "id": "car-330",
    "name": "Mazzanti",
    "models": [
      "Evantra"
    ]
  },
  {
    "id": "car-331",
    "name": "Moke",
    "models": [
      "eMoke",
      "Moke"
    ]
  },
  {
    "id": "car-332",
    "name": "Mole",
    "models": [
      "Almas"
    ]
  },
  {
    "id": "car-333",
    "name": "Mullen",
    "models": [
      "Five RS"
    ]
  },
  {
    "id": "car-334",
    "name": "猛士",
    "models": [
      "猛士M800",
      "猛士917",
      "猛士M817"
    ]
  },
  {
    "id": "car-335",
    "name": "迈越",
    "models": [
      "iMAX8全家版"
    ]
  },
  {
    "id": "car-336",
    "name": "哪吒汽车",
    "models": [
      "哪吒AYA",
      "哪吒X",
      "哪吒L",
      "哪吒S",
      "哪吒S猎装",
      "哪吒E-TAKE",
      "哪吒N01",
      "哪吒N03",
      "哪吒V",
      "哪吒U",
      "哪吒GT"
    ]
  },
  {
    "id": "car-337",
    "name": "纳智捷",
    "models": [
      "纳5",
      "锐3",
      "neora",
      "U5 EV",
      "U5 SUV",
      "纳智捷URX",
      "优6 SUV",
      "大7 SUV",
      "大7 MPV",
      "S5 TURBO",
      "裕隆汽车U5",
      "U6 TURBO",
      "U7 TURBO",
      "纳智捷n⁷"
    ]
  },
  {
    "id": "car-338",
    "name": "NamX",
    "models": [
      "NamX HUV"
    ]
  },
  {
    "id": "car-339",
    "name": "nanoFLOWCELL",
    "models": [
      "QUANT F",
      "Quantino"
    ]
  },
  {
    "id": "car-340",
    "name": "Neuron EV",
    "models": [
      "VEGA",
      "T-ONE"
    ]
  },
  {
    "id": "car-341",
    "name": "Nikola",
    "models": [
      "Badger"
    ]
  },
  {
    "id": "car-342",
    "name": "诺马迪森房车",
    "models": [
      "穿越者",
      "撼路者房车",
      "领航者",
      "流浪者",
      "征途者"
    ]
  },
  {
    "id": "car-343",
    "name": "欧拉",
    "models": [
      "欧拉好猫",
      "欧拉好猫GT",
      "欧拉芭蕾猫",
      "欧拉闪电猫",
      "欧拉5 EV",
      "欧拉樱桃猫",
      "欧拉",
      "欧拉白猫",
      "欧拉黑猫",
      "欧拉iQ",
      "欧拉朋克猫"
    ]
  },
  {
    "id": "car-344",
    "name": "讴歌",
    "models": [
      "讴歌TLX-L",
      "讴歌CDX",
      "讴歌RDX",
      "讴歌ILX",
      "讴歌TLX",
      "讴歌RLX",
      "讴歌ADX",
      "讴歌MDX",
      "讴歌ZDX新能源",
      "讴歌ARX-06",
      "讴歌NSX",
      "讴歌CSX",
      "讴歌TL",
      "讴歌TSX",
      "讴歌Type S",
      "讴歌RL",
      "SUV-X",
      "讴歌ZDX"
    ]
  },
  {
    "id": "car-345",
    "name": "欧宝",
    "models": [
      "欧宝Corsa",
      "Ampera",
      "雅特",
      "雅特新能源",
      "英速亚",
      "Frontera",
      "欧宝Mokka",
      "欧宝Combo",
      "欧宝Vivaro",
      "Agila",
      "欧宝Adam",
      "欧宝RAK",
      "Karl",
      "威达",
      "欧宝GT X",
      "安德拉",
      "麦瑞纳",
      "赛飞利",
      "欧宝GT",
      "欧宝Monza"
    ]
  },
  {
    "id": "car-346",
    "name": "欧朗",
    "models": [
      "欧朗"
    ]
  },
  {
    "id": "car-347",
    "name": "欧联",
    "models": [
      "欧联M1"
    ]
  },
  {
    "id": "car-348",
    "name": "欧铃汽车",
    "models": [
      "活越神童01"
    ]
  },
  {
    "id": "car-349",
    "name": "朋克汽车",
    "models": [
      "朋克多多",
      "朋克啦啦",
      "朋克美美"
    ]
  },
  {
    "id": "car-350",
    "name": "帕加尼",
    "models": [
      "Alisea",
      "Huayra",
      "Utopia",
      "Zonda"
    ]
  },
  {
    "id": "car-351",
    "name": "Pogea Racing",
    "models": [
      "Hercules"
    ]
  },
  {
    "id": "car-352",
    "name": "Praga",
    "models": [
      "Bohema"
    ]
  },
  {
    "id": "car-353",
    "name": "佩奇奥",
    "models": [
      "CEVENNES",
      "Echo",
      "HEMERA"
    ]
  },
  {
    "id": "car-354",
    "name": "普曼·巅峰",
    "models": [
      "天玑系列",
      "天枢系列",
      "星曜系列",
      "星宇系列"
    ]
  },
  {
    "id": "car-355",
    "name": "奇瑞风云",
    "models": [
      "风云T9",
      "风云A8",
      "风云A8L",
      "风云A9L",
      "风云T6",
      "风云X3",
      "风云X3L",
      "风云T8",
      "风云T10",
      "风云E06"
    ]
  },
  {
    "id": "car-356",
    "name": "奇瑞新能源",
    "models": [
      "艾瑞泽e",
      "奇瑞舒享家",
      "奇瑞C3e",
      "奇瑞eQ",
      "奇瑞无界Pro",
      "艾瑞泽5e",
      "瑞虎3xe",
      "瑞虎e",
      "大蚂蚁"
    ]
  },
  {
    "id": "car-357",
    "name": "奇瑞QQ",
    "models": [
      "QQ冰淇淋",
      "小蚂蚁",
      "多米"
    ]
  },
  {
    "id": "car-358",
    "name": "启辰",
    "models": [
      "启辰大V氢境",
      "启辰D60",
      "启辰D60EV",
      "启辰T60",
      "启辰T60EV",
      "启辰大V",
      "启辰星",
      "启辰ViWa",
      "启辰R30",
      "晨风",
      "启辰D50",
      "启辰R50",
      "启辰R50X",
      "启辰e30",
      "启辰T70",
      "启辰T70X",
      "启辰The V",
      "启辰VOW",
      "启辰T90",
      "启辰The X",
      "启辰M50V"
    ]
  },
  {
    "id": "car-359",
    "name": "奇鲁汽车",
    "models": [
      "奇鲁eC1"
    ]
  },
  {
    "id": "car-360",
    "name": "乔治·巴顿",
    "models": [
      "战车",
      "战剑"
    ]
  },
  {
    "id": "car-361",
    "name": "启境",
    "models": [
      "启境GT7"
    ]
  },
  {
    "id": "car-362",
    "name": "骐蔚汽车",
    "models": [
      "骐蔚熊猫宏图",
      "长江9号",
      "长江7号",
      "骐蔚EV7",
      "长江6号"
    ]
  },
  {
    "id": "car-363",
    "name": "全球鹰",
    "models": [
      "全球鹰K10",
      "全球鹰K11",
      "全球鹰K12",
      "全球鹰K17",
      "全球鹰K27",
      "全球鹰K30",
      "全球鹰EX3"
    ]
  },
  {
    "id": "car-364",
    "name": "前途",
    "models": [
      "前途K20",
      "前途K25",
      "前途K50"
    ]
  },
  {
    "id": "car-365",
    "name": "清源汽车",
    "models": [
      "清源小尊",
      "清源尊者"
    ]
  },
  {
    "id": "car-366",
    "name": "轻橙时代",
    "models": [
      "轻橙时代VC"
    ]
  },
  {
    "id": "car-367",
    "name": "骐铃汽车",
    "models": [
      "骐铃T100",
      "骐铃T15",
      "骐铃T3",
      "骐铃T5",
      "骐铃T7"
    ]
  },
  {
    "id": "car-368",
    "name": "睿蓝汽车",
    "models": [
      "睿蓝蓝气球",
      "枫叶60s",
      "睿蓝7",
      "睿蓝9",
      "枫叶80v",
      "枫叶80v L",
      "枫叶01",
      "枫叶30X"
    ]
  },
  {
    "id": "car-369",
    "name": "瑞驰汽车",
    "models": [
      "瑞驰R5",
      "瑞驰C3",
      "瑞驰C5"
    ]
  },
  {
    "id": "car-370",
    "name": "瑞麒",
    "models": [
      "瑞麒M1",
      "瑞麒M1新能源",
      "瑞麒M3",
      "瑞麒G2",
      "瑞麒M5",
      "瑞麒G3",
      "瑞麒G5",
      "瑞麒G6",
      "瑞麒A6CC",
      "瑞麒Z5"
    ]
  },
  {
    "id": "car-371",
    "name": "Red Bull",
    "models": [
      "RB17"
    ]
  },
  {
    "id": "car-372",
    "name": "Rezvani",
    "models": [
      "Tank",
      "Beast"
    ]
  },
  {
    "id": "car-373",
    "name": "Rinspeed",
    "models": [
      "Snap",
      "CitySnap",
      "Dock-Go",
      "Budii",
      "XchangE",
      "Etos",
      "Senso",
      "sQuba"
    ]
  },
  {
    "id": "car-374",
    "name": "仁拓博歌",
    "models": [
      "博歌赛那"
    ]
  },
  {
    "id": "car-375",
    "name": "如虎",
    "models": [
      "如虎 RT",
      "如虎 XL",
      "如虎 CTR",
      "如虎 CTR 3"
    ]
  },
  {
    "id": "car-376",
    "name": "容大智造",
    "models": [
      "迈乔",
      "迈图"
    ]
  },
  {
    "id": "car-377",
    "name": "瑞一汽车",
    "models": [
      "瑞一卡德加"
    ]
  },
  {
    "id": "car-378",
    "name": "瑞腾汽车",
    "models": [
      "瑞腾RT1"
    ]
  },
  {
    "id": "car-379",
    "name": "锐马克",
    "models": [
      "Nevera"
    ]
  },
  {
    "id": "car-380",
    "name": "斯巴鲁",
    "models": [
      "森林人",
      "斯巴鲁BRZ",
      "翼豹",
      "LEVORG",
      "力狮",
      "斯巴鲁Rex",
      "旭豹新能源",
      "傲虎",
      "SOLTERRA",
      "Ascent",
      "Getaway",
      "Hybrid",
      "Viziv",
      "斯巴鲁XV",
      "驰鹏",
      "VIZIV-7",
      "Exiga",
      "Trezia",
      "斯巴鲁SVX"
    ]
  },
  {
    "id": "car-381",
    "name": "深蓝汽车",
    "models": [
      "深蓝L07",
      "深蓝SL03",
      "深蓝S05",
      "深蓝G318",
      "深蓝S09"
    ]
  },
  {
    "id": "car-382",
    "name": "思皓",
    "models": [
      "思皓E20X",
      "花仙子",
      "思皓A5",
      "思皓E50A",
      "思皓E40X",
      "思皓QX",
      "思皓爱跑",
      "思皓曜",
      "思皓X4",
      "爱跑S",
      "思皓X6",
      "思皓X7",
      "思皓X8"
    ]
  },
  {
    "id": "car-383",
    "name": "SERES赛力斯",
    "models": [
      "赛力斯7",
      "赛力斯ix3",
      "赛力斯A5",
      "赛力斯SF5",
      "SF SF7"
    ]
  },
  {
    "id": "car-384",
    "name": "思铭",
    "models": [
      "思铭",
      "东风本田M-NV",
      "东风本田X-NV"
    ]
  },
  {
    "id": "car-385",
    "name": "SWM斯威汽车",
    "models": [
      "SWM斯威G05",
      "SWM斯威大虎",
      "SWM斯威X3",
      "SWM斯威X7",
      "SWM钢铁侠",
      "SWM斯威G01",
      "SWM斯威X2"
    ]
  },
  {
    "id": "car-386",
    "name": "双龙",
    "models": [
      "雷斯特",
      "双龙X200",
      "Musso",
      "主席",
      "RIOS",
      "蒂维拉",
      "双龙e-XIV",
      "双龙XIV-1",
      "双龙XIV-2",
      "柯兰多",
      "爱腾",
      "双龙C200",
      "双龙e-SIV",
      "双龙SIV-1",
      "双龙SIV-2",
      "双龙XAV",
      "途凌",
      "雷斯特W",
      "享御",
      "双龙LIV-1",
      "双龙LIV-2",
      "双龙XAVL",
      "路帝"
    ]
  },
  {
    "id": "car-387",
    "name": "神州",
    "models": [
      "DST神州5号",
      "航天金龙"
    ]
  },
  {
    "id": "car-388",
    "name": "双环",
    "models": [
      "小贵族",
      "来宝SRV",
      "双环SCEO"
    ]
  },
  {
    "id": "car-389",
    "name": "斯达泰克",
    "models": [
      "斯达泰克-卫士",
      "斯达泰克-揽胜"
    ]
  },
  {
    "id": "car-390",
    "name": "速达",
    "models": [
      "速达SD01",
      "速达SA01"
    ]
  },
  {
    "id": "car-391",
    "name": "陕汽通家",
    "models": [
      "福家",
      "龙锐",
      "电牛2号"
    ]
  },
  {
    "id": "car-392",
    "name": "上喆",
    "models": [
      "上喆浩达威霆"
    ]
  },
  {
    "id": "car-393",
    "name": "世爵",
    "models": [
      "世爵D12",
      "世爵B6",
      "世爵C12",
      "世爵C8"
    ]
  },
  {
    "id": "car-394",
    "name": "沙龙汽车",
    "models": [
      "机甲龙"
    ]
  },
  {
    "id": "car-395",
    "name": "萨博",
    "models": [
      "Saab 92",
      "Saab 96",
      "Saab 900",
      "Saab 93",
      "Saab 9-3",
      "Saab 99",
      "Saab 9-5",
      "Saab 9-7",
      "PhoeniX",
      "Saab 9-X",
      "Sonett"
    ]
  },
  {
    "id": "car-396",
    "name": "赛麟",
    "models": [
      "迈客",
      "赛麟领道",
      "赛麟S1",
      "赛麟S7",
      "赛麟科迈罗",
      "赛麟挑战者"
    ]
  },
  {
    "id": "car-397",
    "name": "Scion",
    "models": [
      "Scion iQ",
      "Scion iA",
      "Scion xA",
      "Scion xB",
      "Scion xD",
      "Scion iM",
      "Scion tC"
    ]
  },
  {
    "id": "car-398",
    "name": "Scout",
    "models": [
      "Terra皮卡"
    ]
  },
  {
    "id": "car-399",
    "name": "Share2Drive",
    "models": [
      "SVEN"
    ]
  },
  {
    "id": "car-400",
    "name": "SHELBY",
    "models": [
      "Cobra"
    ]
  },
  {
    "id": "car-401",
    "name": "SIN CARS",
    "models": [
      "SIN R1"
    ]
  },
  {
    "id": "car-402",
    "name": "SONGSAN MOTORS",
    "models": [
      "MONTEREY",
      "SS GT"
    ]
  },
  {
    "id": "car-403",
    "name": "Sono Motors",
    "models": [
      "Sion"
    ]
  },
  {
    "id": "car-404",
    "name": "SONY",
    "models": [
      "VISION-S"
    ]
  },
  {
    "id": "car-405",
    "name": "Spofec",
    "models": [
      "Spofec魅影",
      "Spofec曜影"
    ]
  },
  {
    "id": "car-406",
    "name": "Spyros Panopoulos",
    "models": [
      "Chaos"
    ]
  },
  {
    "id": "car-407",
    "name": "SSC",
    "models": [
      "Tuatara",
      "Ultimate"
    ]
  },
  {
    "id": "car-408",
    "name": "STI",
    "models": [
      "STI E-RA"
    ]
  },
  {
    "id": "car-409",
    "name": "上汽跃进",
    "models": [
      "跃进福星S",
      "跃进大拿T2"
    ]
  },
  {
    "id": "car-410",
    "name": "上汽集团",
    "models": [
      "鲲"
    ]
  },
  {
    "id": "car-411",
    "name": "上海",
    "models": [
      "上海SH760"
    ]
  },
  {
    "id": "car-412",
    "name": "世极",
    "models": [
      "世极"
    ]
  },
  {
    "id": "car-413",
    "name": "尚界",
    "models": [
      "尚界H5"
    ]
  },
  {
    "id": "car-414",
    "name": "申龙汽车",
    "models": [
      "申龙V6",
      "申龙地上铁510"
    ]
  },
  {
    "id": "car-415",
    "name": "示界",
    "models": [
      "示界06"
    ]
  },
  {
    "id": "car-416",
    "name": "赛德房车",
    "models": [
      "赛德卡 野MAN",
      "赛德卡700",
      "白鲸",
      "猎鹰房车"
    ]
  },
  {
    "id": "car-417",
    "name": "赛沸尔房车",
    "models": [
      "赛沸尔F590B",
      "星鳐E900",
      "赛沸尔C620"
    ]
  },
  {
    "id": "car-418",
    "name": "首望",
    "models": [
      "首望"
    ]
  },
  {
    "id": "car-419",
    "name": "坦克",
    "models": [
      "坦克300",
      "坦克300新能源",
      "坦克400",
      "坦克400新能源",
      "坦克500",
      "坦克500新能源",
      "坦克700",
      "坦克800"
    ]
  },
  {
    "id": "car-420",
    "name": "腾势",
    "models": [
      "腾势Z9",
      "腾势Z9GT",
      "腾势N7",
      "腾势N8L",
      "腾势N9",
      "腾势",
      "腾势X",
      "腾势N8"
    ]
  },
  {
    "id": "car-421",
    "name": "特斯拉",
    "models": [
      "Model 3",
      "Model Y",
      "Model S",
      "Model X",
      "Cybercab",
      "赛博SUV",
      "Roadster",
      "Robovan"
    ]
  },
  {
    "id": "car-422",
    "name": "Theon Design",
    "models": [
      "HK002"
    ]
  },
  {
    "id": "car-423",
    "name": "Touring Superleggera",
    "models": [
      "Veloce12"
    ]
  },
  {
    "id": "car-424",
    "name": "TVR",
    "models": [
      "Griffith",
      "Sagaris",
      "Tuscan"
    ]
  },
  {
    "id": "car-425",
    "name": "塔塔",
    "models": [
      "Altroz",
      "Tiago",
      "Nexon",
      "Nexon新能源",
      "塔塔HBX",
      "Punch.ev",
      "Safari",
      "塔塔CURVV",
      "HEXA",
      "AVINYA",
      "Xenon",
      "Zica",
      "Kite 5",
      "EVision"
    ]
  },
  {
    "id": "car-426",
    "name": "天际汽车",
    "models": [
      "天际ME-S",
      "天际ME5",
      "天际ME7"
    ]
  },
  {
    "id": "car-427",
    "name": "拓锐斯特",
    "models": [
      "拓锐斯特威霆"
    ]
  },
  {
    "id": "car-428",
    "name": "泰克鲁斯·腾风",
    "models": [
      "至仁"
    ]
  },
  {
    "id": "car-429",
    "name": "途柚汽车",
    "models": [
      "途柚 潮",
      "途柚 浪"
    ]
  },
  {
    "id": "car-430",
    "name": "Vega Innovations",
    "models": [
      "Vega EVX"
    ]
  },
  {
    "id": "car-431",
    "name": "Venturi",
    "models": [
      "America"
    ]
  },
  {
    "id": "car-432",
    "name": "Vinfast",
    "models": [
      "LUX A2.0",
      "Lux V8"
    ]
  },
  {
    "id": "car-433",
    "name": "VIRITECH",
    "models": [
      "Apricale"
    ]
  },
  {
    "id": "car-434",
    "name": "VLF Automotive",
    "models": [
      "Force 1"
    ]
  },
  {
    "id": "car-435",
    "name": "沃尔沃",
    "models": [
      "沃尔沃EX30",
      "沃尔沃S60",
      "沃尔沃S90",
      "沃尔沃XC40",
      "沃尔沃XC60",
      "沃尔沃C40",
      "沃尔沃S40",
      "沃尔沃S80L",
      "沃尔沃V60",
      "沃尔沃V90",
      "沃尔沃XC90",
      "Estate",
      "沃尔沃C30",
      "沃尔沃V40",
      "沃尔沃V50",
      "沃尔沃S80",
      "沃尔沃V70",
      "Universe",
      "沃尔沃You",
      "沃尔沃XC70",
      "XC Coupe",
      "沃尔沃C70",
      "沃尔沃Coupe"
    ]
  },
  {
    "id": "car-436",
    "name": "蔚来",
    "models": [
      "蔚来ET9",
      "蔚来ET7",
      "蔚来EC7",
      "蔚来EVE",
      "蔚来ES7",
      "蔚来EP9"
    ]
  },
  {
    "id": "car-437",
    "name": "魏牌",
    "models": [
      "魏牌 蓝山",
      "魏牌 高山",
      "圆梦",
      "WEY-S",
      "WEY-X",
      "玛奇朵DHT",
      "魏牌 VV5",
      "魏牌 VV6",
      "魏牌 拿铁DHT",
      "魏牌 P8",
      "魏牌 VV7",
      "魏牌 XEV",
      "魏牌 摩卡",
      "魏牌 V9X"
    ]
  },
  {
    "id": "car-438",
    "name": "五十铃",
    "models": [
      "庆铃五十铃T30",
      "庆铃五十铃轻卡",
      "TAGA达咖",
      "TAGA达咖H",
      "TAGA达咖纯电",
      "庆铃T28",
      "庆铃五十铃T17",
      "竞技者",
      "五十铃皮卡",
      "mu-X牧游侠",
      "翼放",
      "翼放EV",
      "铃拓",
      "瑞迈EV",
      "RE-MAX"
    ]
  },
  {
    "id": "car-439",
    "name": "WALD",
    "models": [
      "WALD LX",
      "WALD RX",
      "WALD普拉多",
      "WALD埃尔法",
      "WALD威尔法"
    ]
  },
  {
    "id": "car-440",
    "name": "潍柴英致",
    "models": [
      "英致EX1",
      "英致G3",
      "英致G5",
      "英致727",
      "英致737",
      "英致737EV",
      "英致P80"
    ]
  },
  {
    "id": "car-441",
    "name": "万象汽车",
    "models": [
      "万象T02",
      "万象T01",
      "万象K01"
    ]
  },
  {
    "id": "car-442",
    "name": "万达客车",
    "models": [
      "瑞擎V6"
    ]
  },
  {
    "id": "car-443",
    "name": "伟昊汽车",
    "models": [
      "卡漠兹V级",
      "塞里雅兰V级"
    ]
  },
  {
    "id": "car-444",
    "name": "威兹曼",
    "models": [
      "威兹曼GT"
    ]
  },
  {
    "id": "car-445",
    "name": "威马汽车",
    "models": [
      "威马Maven",
      "威马E.5",
      "威马M7",
      "威马EX5",
      "威马AG2020",
      "威马EX6",
      "威马W6",
      "威马冠军"
    ]
  },
  {
    "id": "car-446",
    "name": "威麟",
    "models": [
      "威麟R08",
      "威麟R08 EV",
      "捷想者",
      "威麟P2X",
      "威麟P3X",
      "威麟X5",
      "威麟V5",
      "威麟V8",
      "威麟H3",
      "威麟H5",
      "威麟H6"
    ]
  },
  {
    "id": "car-447",
    "name": "未奥汽车",
    "models": [
      "未奥BOMA"
    ]
  },
  {
    "id": "car-448",
    "name": "沃克斯豪尔",
    "models": [
      "Astra",
      "VIVA",
      "Antara",
      "Maloo"
    ]
  },
  {
    "id": "car-449",
    "name": "沃森威尔",
    "models": [
      "沃森威尔路咖啡"
    ]
  },
  {
    "id": "car-450",
    "name": "瓦滋",
    "models": [
      "旅行者"
    ]
  },
  {
    "id": "car-451",
    "name": "维努斯",
    "models": [
      "维努斯"
    ]
  },
  {
    "id": "car-452",
    "name": "星途",
    "models": [
      "星途ES7 GT",
      "星纪元 ES",
      "星途追风",
      "星途追风C-DM",
      "星途ET5",
      "星途凌云",
      "星途瑶光",
      "星纪元 ET",
      "AtlantiX",
      "星途M38T",
      "星途EX9",
      "星途天玑",
      "星途E08",
      "星途X",
      "星途TX",
      "星途E-IUV"
    ]
  },
  {
    "id": "car-453",
    "name": "小鹏",
    "models": [
      "小鹏P7",
      "小鹏P7+",
      "小鹏G6",
      "小鹏G7",
      "小鹏G9",
      "小鹏X9",
      "小鹏N5",
      "小鹏P5",
      "小鹏BETA版",
      "小鹏G3",
      "小鹏E29"
    ]
  },
  {
    "id": "car-454",
    "name": "AM晓澳",
    "models": [
      "晓澳VITO"
    ]
  },
  {
    "id": "car-455",
    "name": "新龙马汽车",
    "models": [
      "启腾M70",
      "启腾M70EV",
      "启腾N30",
      "启腾N50",
      "启腾N50EV",
      "启腾N60",
      "龙7",
      "启腾EX7",
      "启腾V60",
      "启腾EX80"
    ]
  },
  {
    "id": "car-456",
    "name": "新吉奥",
    "models": [
      "吉奥睿征",
      "吉奥睿征L",
      "吉奥帅豹",
      "吉奥帅凌",
      "吉奥奥腾",
      "吉奥帅舰"
    ]
  },
  {
    "id": "car-457",
    "name": "新特汽车",
    "models": [
      "启能GEV 1",
      "新特AEV"
    ]
  },
  {
    "id": "car-458",
    "name": "西雅特",
    "models": [
      "Minimo",
      "伊比飒",
      "EL-BORN",
      "LEON",
      "LEON新能源",
      "Arona",
      "Ateca",
      "Tarraco",
      "西雅特Mii",
      "Altea",
      "西雅特IBE",
      "Toledo",
      "Exeo",
      "西雅特IBL",
      "西雅特IBX",
      "西雅特20V20",
      "欧悦搏"
    ]
  },
  {
    "id": "car-459",
    "name": "小猬汽车",
    "models": [
      "思迈尔",
      "小猬EV400"
    ]
  },
  {
    "id": "car-460",
    "name": "小虎",
    "models": [
      "小虎EV"
    ]
  },
  {
    "id": "car-461",
    "name": "鑫源汽车",
    "models": [
      "鑫源T1L EV",
      "鑫源T3L EV",
      "豪运",
      "好运",
      "鑫源E3",
      "鑫源T5L EV",
      "好运1号",
      "好运2号",
      "启运",
      "鑫源T2S EV",
      "鑫源T50 EV",
      "金海狮",
      "金海狮M",
      "鑫源T3",
      "鑫源金卡S1",
      "鑫源小海狮X30"
    ]
  },
  {
    "id": "car-462",
    "name": "XEV",
    "models": [
      "XEV YOYO"
    ]
  },
  {
    "id": "car-463",
    "name": "享界",
    "models": [
      "享界S9",
      "享界S9T"
    ]
  },
  {
    "id": "car-464",
    "name": "小米汽车",
    "models": [
      "小米SU7",
      "小米YU7",
      "小米增程式SUV"
    ]
  },
  {
    "id": "car-465",
    "name": "新凯",
    "models": [
      "凯胜",
      "新凯威霆",
      "新凯凌特"
    ]
  },
  {
    "id": "car-466",
    "name": "星海狮",
    "models": [
      "快运王",
      "快运王EV1",
      "快运王V2"
    ]
  },
  {
    "id": "car-467",
    "name": "霞客乐房车",
    "models": [
      "福特眼镜蛇旅行版",
      "纳瓦拉SUC",
      "锐骐7 SUC",
      "星际H机甲牛"
    ]
  },
  {
    "id": "car-468",
    "name": "英菲尼迪",
    "models": [
      "英菲尼迪QX80",
      "英菲尼迪Q50",
      "英菲尼迪QX65",
      "英菲尼迪Q60",
      "Etherea",
      "英菲尼迪Q30",
      "英菲尼迪G系",
      "英菲尼迪LE",
      "英菲尼迪M系",
      "英菲尼迪Q70",
      "英菲尼迪Q80",
      "英菲尼迪ESQ",
      "英菲尼迪QX30",
      "英菲尼迪EX",
      "英菲尼迪QX55",
      "英菲尼迪FX",
      "英菲尼迪JX",
      "英菲尼迪QX70",
      "英菲尼迪QX",
      "Emerg-E",
      "Essence",
      "英菲尼迪Q60S",
      "英菲尼迪QX50",
      "英菲尼迪QX60",
      "英菲尼迪Q50L"
    ]
  },
  {
    "id": "car-469",
    "name": "依维柯",
    "models": [
      "意路达",
      "依维柯得意",
      "依维柯聚星",
      "依维柯欧霸",
      "依维柯欧风",
      "依维柯欧胜新能源",
      "都灵",
      "依维柯褒迪",
      "依维柯褒迪新能源",
      "依维柯得意新能源",
      "依维柯威尼斯之旅",
      "Daily",
      "Massif"
    ]
  },
  {
    "id": "car-470",
    "name": "御捷",
    "models": [
      "捷顺",
      "御捷330",
      "御捷E驰"
    ]
  },
  {
    "id": "car-471",
    "name": "野马汽车",
    "models": [
      "野马芒果",
      "野马C30",
      "博骏",
      "野马C18",
      "野马F10",
      "野马F12",
      "野马F16",
      "野马F18",
      "野马F99",
      "野马T系",
      "野马EC70",
      "野马E系",
      "野马F19",
      "野马T70",
      "野马T80",
      "斯派卡",
      "斯派卡新能源",
      "野马A-MPV",
      "野马EC30",
      "野马M302",
      "野马M31D",
      "野马M72",
      "野马MINI卡"
    ]
  },
  {
    "id": "car-472",
    "name": "野马新能源",
    "models": [
      "星歌",
      "野马EC60"
    ]
  },
  {
    "id": "car-473",
    "name": "雅升汽车",
    "models": [
      "雅升VITO"
    ]
  },
  {
    "id": "car-474",
    "name": "越界",
    "models": [
      "斯宾特",
      "泰坦S6",
      "盖亚350",
      "越界A6",
      "越界露营大师G7",
      "越界铸镕"
    ]
  },
  {
    "id": "car-475",
    "name": "云度",
    "models": [
      "云度π1",
      "云兔",
      "云度K3",
      "云度Xπ",
      "云度π3",
      "云度π7",
      "云度V01L"
    ]
  },
  {
    "id": "car-476",
    "name": "远程",
    "models": [
      "远程星智",
      "远程锋锐V5M",
      "远程星享F1E",
      "吉利幸福号",
      "远程星享V",
      "远程锋锐",
      "远程星智F5E",
      "远程星享E6",
      "远程FX",
      "远程E5"
    ]
  },
  {
    "id": "car-477",
    "name": "悠宝利",
    "models": [
      "悠宝利A3"
    ]
  },
  {
    "id": "car-478",
    "name": "运良汽车",
    "models": [
      "战马"
    ]
  },
  {
    "id": "car-479",
    "name": "IMSA英飒",
    "models": [
      "IMSA S级"
    ]
  },
  {
    "id": "car-480",
    "name": "一汽凌河",
    "models": [
      "雷神"
    ]
  },
  {
    "id": "car-481",
    "name": "云雀汽车",
    "models": [
      "全界Q1"
    ]
  },
  {
    "id": "car-482",
    "name": "宇通客车",
    "models": [
      "宇通T7",
      "宇通T7新能源",
      "宇通天骏",
      "宇通天骏V6E",
      "宇通CL6"
    ]
  },
  {
    "id": "car-483",
    "name": "永源",
    "models": [
      "猎鹰",
      "永源A380",
      "永源五星"
    ]
  },
  {
    "id": "car-484",
    "name": "裕路",
    "models": [
      "裕路EV2"
    ]
  },
  {
    "id": "car-485",
    "name": "予风汽车",
    "models": [
      "予风黄金仓"
    ]
  },
  {
    "id": "car-486",
    "name": "亚星房车",
    "models": [
      "欧瑞房车"
    ]
  },
  {
    "id": "car-487",
    "name": "亚特房车",
    "models": [
      "NAJA-V1",
      "尊领",
      "尊致"
    ]
  },
  {
    "id": "car-488",
    "name": "仰望",
    "models": [
      "仰望U7",
      "仰望易四方",
      "仰望U8",
      "仰望U8 L",
      "仰望U9"
    ]
  },
  {
    "id": "car-489",
    "name": "奕境",
    "models": [
      "奕境X9"
    ]
  },
  {
    "id": "car-490",
    "name": "宇通房车",
    "models": [
      "威迈E",
      "骏迈M",
      "Y6小熊猫"
    ]
  },
  {
    "id": "car-491",
    "name": "易电易行",
    "models": [
      "易电易行FS6"
    ]
  },
  {
    "id": "car-492",
    "name": "游侠",
    "models": [
      "游侠 X"
    ]
  },
  {
    "id": "car-493",
    "name": "游心",
    "models": [
      "游心P1",
      "游心A1"
    ]
  },
  {
    "id": "car-494",
    "name": "翼刻",
    "models": [
      "翼刻信"
    ]
  },
  {
    "id": "car-495",
    "name": "英力士掷弹兵",
    "models": [
      "英力士掷弹兵"
    ]
  },
  {
    "id": "car-496",
    "name": "远航汽车",
    "models": [
      "远航Y6",
      "远航Y7",
      "远航H8",
      "远航H9"
    ]
  },
  {
    "id": "car-497",
    "name": "银隆新能源",
    "models": [
      "银隆艾菲",
      "银隆5024EV"
    ]
  },
  {
    "id": "car-498",
    "name": "智己汽车",
    "models": [
      "智己L6",
      "智己LS6",
      "智己L7",
      "智己LS7",
      "智己LS9",
      "AIRO"
    ]
  },
  {
    "id": "car-499",
    "name": "中国重汽VGV",
    "models": [
      "VGV U70",
      "VGV U75",
      "VGV VX7",
      "VGV TX7"
    ]
  },
  {
    "id": "car-500",
    "name": "中兴",
    "models": [
      "中兴1949房车",
      "领主",
      "威虎",
      "小老虎",
      "中兴1949",
      "中兴1986",
      "中兴FM3",
      "小老虎EV",
      "陆地方舟",
      "中兴CP2",
      "驰野-鑫精英",
      "威虎SUV",
      "无限",
      "无限V3",
      "无限V5",
      "无限V7",
      "昌铃",
      "旗舰A9",
      "威虎G3",
      "中兴C3",
      "中兴GX3"
    ]
  },
  {
    "id": "car-501",
    "name": "知豆",
    "models": [
      "知豆彩虹",
      "知豆",
      "知豆D1",
      "知豆D2",
      "知豆D3"
    ]
  },
  {
    "id": "car-502",
    "name": "之诺",
    "models": [
      "Next",
      "之诺1E",
      "之诺60H"
    ]
  },
  {
    "id": "car-503",
    "name": "自游家",
    "models": [
      "自游家NV"
    ]
  },
  {
    "id": "car-504",
    "name": "Zenvo",
    "models": [
      "Zenvo"
    ]
  },
  {
    "id": "car-505",
    "name": "中国重汽",
    "models": [
      "搏胜",
      "先锋官V",
      "先锋官V EV"
    ]
  },
  {
    "id": "car-506",
    "name": "中意房车",
    "models": [
      "游牧时代",
      "重骑兵",
      "星河SC5",
      "星河SC7",
      "轻骑兵",
      "斯宾特房车",
      "精灵款拖挂旅居车"
    ]
  },
  {
    "id": "car-507",
    "name": "中通客车",
    "models": [
      "中通T7"
    ]
  },
  {
    "id": "car-508",
    "name": "尊界",
    "models": [
      "尊界S800"
    ]
  },
  {
    "id": "car-509",
    "name": "智点汽车",
    "models": [
      "智点F101微面",
      "智点F101微卡",
      "智点K201"
    ]
  },
  {
    "id": "car-510",
    "name": "智界",
    "models": [
      "智界S7",
      "智界R7"
    ]
  },
  {
    "id": "car-511",
    "name": "智锐汽车",
    "models": [
      "OBBIN星海",
      "OBBIN星河",
      "欧尔法"
    ]
  },
  {
    "id": "car-512",
    "name": "正道汽车",
    "models": [
      "正道GT",
      "正道H600",
      "正道K750",
      "正道H500",
      "正道K350",
      "正道K550"
    ]
  },
  {
    "id": "car-513",
    "name": "纵横",
    "models": [
      "纵横G600",
      "纵横G900",
      "纵横F700"
    ]
  },
  {
    "id": "car-514",
    "name": "追觅",
    "models": [
      "追觅SUV",
      "追觅概念车"
    ]
  }
];

const truckCatalog: VehicleBrandCatalogItem[] = [
  {
    "id": "truck-1",
    "name": "五菱汽车",
    "models": [
      "五菱宏光",
      "五菱宏光S",
      "五菱宏光V",
      "五菱荣光",
      "五菱荣光V",
      "五菱荣光小卡",
      "五菱荣光新卡",
      "五菱之光",
      "五菱之光小卡",
      "五菱征程",
      "五菱扬光",
      "五菱PN货车",
      "五菱兴旺",
      "五菱鸿途",
      "五菱龙卡"
    ],
    "aliases": [
      "五菱"
    ]
  },
  {
    "id": "truck-2",
    "name": "长安凯程",
    "models": [
      "长安之星",
      "长安之星2",
      "长安之星3",
      "长安之星5",
      "长安之星7",
      "长安之星9",
      "长安之星S460",
      "长安星卡",
      "长安神骐T10",
      "长安神骐T20",
      "长安神骐T30",
      "长安睿行M60",
      "长安睿行M80",
      "长安睿行M90",
      "欧诺S",
      "长安小卡",
      "长安跨越王"
    ],
    "aliases": [
      "长安商用",
      "长安微车"
    ]
  },
  {
    "id": "truck-3",
    "name": "东风小康",
    "models": [
      "东风小康K01",
      "东风小康K02",
      "东风小康K05",
      "东风小康K07",
      "东风小康K07S",
      "东风小康K17",
      "东风小康V07S",
      "东风小康V21",
      "东风小康V22",
      "东风小康C31",
      "东风小康C32",
      "东风小康C35",
      "东风小康C36",
      "东风小康C37",
      "东风小康C51",
      "东风小康C52",
      "东风小康EC36"
    ],
    "aliases": [
      "小康",
      "东风微车"
    ]
  },
  {
    "id": "truck-4",
    "name": "金杯",
    "models": [
      "金杯海狮",
      "金杯海狮王",
      "金杯快运",
      "金杯阁瑞斯",
      "金杯小海狮X30",
      "金杯T20",
      "金杯T22",
      "金杯T30",
      "金杯T32",
      "金杯T50",
      "金杯T52",
      "金杯新快运",
      "金杯大海狮"
    ],
    "aliases": [
      "华晨金杯"
    ]
  },
  {
    "id": "truck-5",
    "name": "福田",
    "models": [
      "福田祥菱V",
      "福田祥菱M",
      "福田祥菱Q",
      "福田时代小卡",
      "福田时代驭菱",
      "福田时代领航",
      "福田风景",
      "福田图雅诺",
      "福田蒙派克",
      "福田奥铃",
      "福田欧马可",
      "福田瑞沃",
      "福田萨普",
      "福田拓陆者"
    ],
    "aliases": [
      "北汽福田"
    ]
  },
  {
    "id": "truck-6",
    "name": "江铃",
    "models": [
      "江铃宝典",
      "江铃顺达",
      "江铃凯运",
      "江铃凯锐",
      "江铃域虎",
      "江铃特顺",
      "江铃福顺",
      "江铃全顺",
      "江铃大道",
      "江铃E路顺"
    ],
    "aliases": [
      "JMC"
    ]
  },
  {
    "id": "truck-7",
    "name": "江淮",
    "models": [
      "江淮康铃",
      "江淮骏铃",
      "江淮帅铃",
      "江淮好运",
      "江淮威铃",
      "江淮瑞铃",
      "江淮瑞风",
      "江淮瑞风M3",
      "江淮瑞风M4",
      "江淮星锐",
      "江淮V7",
      "江淮皮卡"
    ],
    "aliases": [
      "JAC"
    ]
  },
  {
    "id": "truck-8",
    "name": "上汽大通MAXUS",
    "models": [
      "大通V80",
      "大通V90",
      "大通G10",
      "大通T60",
      "大通T70",
      "大通T90",
      "大通EV30",
      "大通EV80",
      "大通新途V70",
      "大通新途V80"
    ],
    "aliases": [
      "大通",
      "MAXUS"
    ]
  },
  {
    "id": "truck-9",
    "name": "依维柯",
    "models": [
      "依维柯得意",
      "依维柯都灵",
      "依维柯宝迪",
      "依维柯褒迪",
      "依维柯欧胜",
      "依维柯欧霸",
      "依维柯聚星",
      "依维柯Daily"
    ],
    "aliases": [
      "南京依维柯"
    ]
  },
  {
    "id": "truck-10",
    "name": "东风汽车",
    "models": [
      "东风多利卡",
      "东风途逸",
      "东风小霸王",
      "东风福瑞卡",
      "东风锐骐",
      "东风御风",
      "东风凯普特",
      "东风天锦",
      "东风天龙",
      "东风华神"
    ],
    "aliases": [
      "东风"
    ]
  },
  {
    "id": "truck-11",
    "name": "解放",
    "models": [
      "解放虎V",
      "解放霸铃",
      "解放J6F",
      "解放J6L",
      "解放J6P",
      "解放J7",
      "解放领途",
      "解放轻卡",
      "解放赛龙"
    ],
    "aliases": [
      "一汽解放"
    ]
  },
  {
    "id": "truck-12",
    "name": "中国重汽",
    "models": [
      "重汽豪沃",
      "重汽HOWO",
      "重汽汕德卡",
      "重汽黄河",
      "重汽王牌",
      "先锋官V",
      "搏胜"
    ],
    "aliases": [
      "重汽",
      "HOWO"
    ]
  },
  {
    "id": "truck-13",
    "name": "庆铃",
    "models": [
      "庆铃五十铃100P",
      "庆铃五十铃600P",
      "庆铃五十铃700P",
      "庆铃KV100",
      "庆铃KV600",
      "庆铃达咖",
      "庆铃TAGA"
    ],
    "aliases": [
      "庆铃五十铃",
      "五十铃"
    ]
  },
  {
    "id": "truck-14",
    "name": "跃进",
    "models": [
      "跃进小福星",
      "跃进福星",
      "跃进超越",
      "跃进帅虎",
      "跃进开拓",
      "跃进大拿T2"
    ],
    "aliases": [
      "上汽跃进"
    ]
  },
  {
    "id": "truck-15",
    "name": "开瑞",
    "models": [
      "开瑞优优",
      "开瑞优劲",
      "开瑞优派",
      "开瑞优雅",
      "开瑞K50",
      "开瑞K60",
      "开瑞江豚",
      "开瑞小象"
    ],
    "aliases": [
      "奇瑞开瑞"
    ]
  },
  {
    "id": "truck-16",
    "name": "鑫源汽车",
    "models": [
      "鑫源T1",
      "鑫源T3",
      "鑫源T5",
      "鑫源X30L",
      "鑫源好运",
      "鑫源海狮",
      "金杯金卡",
      "SRM鑫源"
    ],
    "aliases": [
      "鑫源",
      "SRM"
    ]
  },
  {
    "id": "truck-17",
    "name": "北汽昌河",
    "models": [
      "昌河福瑞达",
      "昌河福运",
      "昌河海豚",
      "昌河M50",
      "昌河北斗星",
      "昌河Q25"
    ],
    "aliases": [
      "昌河"
    ]
  },
  {
    "id": "truck-18",
    "name": "长城",
    "models": [
      "风骏3",
      "风骏5",
      "风骏6",
      "风骏7",
      "金迪尔",
      "赛铃",
      "炮",
      "金刚炮",
      "山海炮",
      "长城皮卡"
    ],
    "aliases": [
      "长城皮卡"
    ]
  },
  {
    "id": "truck-19",
    "name": "中兴",
    "models": [
      "中兴威虎",
      "中兴旗舰",
      "中兴领主",
      "中兴小老虎",
      "中兴无限",
      "中兴1949"
    ],
    "aliases": [
      "中兴皮卡"
    ]
  },
  {
    "id": "truck-20",
    "name": "黄海",
    "models": [
      "黄海大柴神",
      "黄海小柴神",
      "黄海N1",
      "黄海N2",
      "黄海N3",
      "黄海傲骏",
      "黄海旗胜",
      "黄海大牛"
    ],
    "aliases": [
      "曙光黄海"
    ]
  },
  {
    "id": "truck-21",
    "name": "凯马",
    "models": [
      "凯马锐菱",
      "凯马锐捷",
      "凯马锐航",
      "凯马骏航",
      "凯马好运来",
      "凯马福运来"
    ]
  },
  {
    "id": "truck-22",
    "name": "陕汽",
    "models": [
      "陕汽德龙",
      "陕汽奥龙",
      "陕汽轩德",
      "陕汽通家福家",
      "陕汽通家龙锐",
      "电牛2号"
    ],
    "aliases": [
      "陕汽通家"
    ]
  },
  {
    "id": "truck-23",
    "name": "福汽启腾",
    "models": [
      "启腾M70",
      "启腾M70EV",
      "启腾N30",
      "启腾EX80",
      "启腾V60"
    ],
    "aliases": [
      "启腾"
    ]
  },
  {
    "id": "truck-24",
    "name": "南京金龙",
    "models": [
      "开沃D11",
      "开沃D10",
      "开沃D07",
      "开沃海豚",
      "开沃货车"
    ],
    "aliases": [
      "开沃"
    ]
  }
];

const motorcycleCatalog: VehicleBrandCatalogItem[] = [
  {
    "id": "motorcycle-1",
    "name": "豪爵铃木",
    "models": [
      "GN125",
      "EN125",
      "HJ125-8",
      "HJ125K",
      "HJ150",
      "HJ150-9",
      "铃木王GS125",
      "锐爽EN150",
      "钻豹HJ125",
      "骊驰GW250",
      "DL250",
      "DR160"
    ],
    "aliases": [
      "豪爵",
      "铃木"
    ]
  },
  {
    "id": "motorcycle-2",
    "name": "五羊本田",
    "models": [
      "CG125",
      "WH125",
      "锋翔125",
      "锋朗125",
      "佳御110",
      "喜悦100",
      "优悦110",
      "幻影150",
      "猛鸷190",
      "鸷道190",
      "CB190R",
      "统御125"
    ],
    "aliases": [
      "五羊",
      "本田"
    ]
  },
  {
    "id": "motorcycle-3",
    "name": "新大洲本田",
    "models": [
      "CBF125",
      "CBF150",
      "战鹰150",
      "SDH125",
      "Dio",
      "裂行125",
      "NS125D",
      "NS125LA",
      "EX125",
      "CRF190L",
      "CBF190R"
    ],
    "aliases": [
      "新大洲",
      "本田"
    ]
  },
  {
    "id": "motorcycle-4",
    "name": "建设雅马哈",
    "models": [
      "天剑YBR125",
      "天戟YB125",
      "劲悍YBR250",
      "飞致YS150",
      "飞致YS250",
      "巧格i",
      "福喜",
      "迅鹰",
      "凌鹰",
      "丽鹰",
      "赛鹰"
    ],
    "aliases": [
      "雅马哈",
      "建设"
    ]
  },
  {
    "id": "motorcycle-5",
    "name": "轻骑铃木",
    "models": [
      "铃木王GS125",
      "QS125",
      "QS150",
      "骏驰GT125",
      "丽彩UZ125",
      "锋彩QS125",
      "悠E UE125",
      "UU125",
      "UY125"
    ],
    "aliases": [
      "济南铃木",
      "铃木"
    ]
  },
  {
    "id": "motorcycle-6",
    "name": "钱江摩托",
    "models": [
      "钱江125",
      "钱江150",
      "钱江龙150",
      "QJ150",
      "QJ125",
      "闪150",
      "追150",
      "赛250",
      "贝纳利小黄龙",
      "贝纳利黄龙300"
    ],
    "aliases": [
      "钱江",
      "QJMOTOR",
      "贝纳利"
    ]
  },
  {
    "id": "motorcycle-7",
    "name": "宗申",
    "models": [
      "宗申125",
      "宗申150",
      "宗申200",
      "宗申三轮摩托",
      "宗申RX1",
      "宗申RX3",
      "宗申MO悦",
      "宗申赛科龙RT1"
    ],
    "aliases": [
      "赛科龙"
    ]
  },
  {
    "id": "motorcycle-8",
    "name": "隆鑫",
    "models": [
      "隆鑫125",
      "隆鑫150",
      "隆鑫200",
      "隆鑫三轮摩托",
      "无极150",
      "无极300",
      "无极500",
      "劲隆JL125"
    ],
    "aliases": [
      "无极",
      "劲隆"
    ]
  },
  {
    "id": "motorcycle-9",
    "name": "力帆",
    "models": [
      "力帆125",
      "力帆150",
      "力帆KP150",
      "力帆KPR150",
      "力帆V16",
      "力帆三轮摩托",
      "力帆太子"
    ]
  },
  {
    "id": "motorcycle-10",
    "name": "嘉陵",
    "models": [
      "嘉陵70",
      "嘉陵90",
      "嘉陵125",
      "嘉陵JH125",
      "嘉陵本田70",
      "嘉陵街火",
      "嘉陵三轮摩托"
    ],
    "aliases": [
      "嘉陵本田"
    ]
  },
  {
    "id": "motorcycle-11",
    "name": "大阳",
    "models": [
      "大阳90",
      "大阳110",
      "大阳125",
      "大阳弯梁",
      "大阳踏板",
      "大阳天昴DY150",
      "大阳ADV150",
      "大阳V锐"
    ]
  },
  {
    "id": "motorcycle-12",
    "name": "大运",
    "models": [
      "大运125",
      "大运150",
      "大运DY125",
      "大运风驰",
      "大运天錾",
      "大运三轮摩托"
    ]
  },
  {
    "id": "motorcycle-13",
    "name": "建设",
    "models": [
      "建设JS125",
      "建设JS150",
      "建设弯梁",
      "建设踏板",
      "建设三轮摩托",
      "建设雅马哈"
    ]
  },
  {
    "id": "motorcycle-14",
    "name": "金城",
    "models": [
      "金城铃木AX100",
      "金城70",
      "金城100",
      "金城125",
      "金城草蜢",
      "金城提拉米苏",
      "金城圣甲虫"
    ],
    "aliases": [
      "金城铃木"
    ]
  },
  {
    "id": "motorcycle-15",
    "name": "银钢",
    "models": [
      "银钢迷你",
      "银钢大怪兽",
      "银钢拿铁",
      "银钢YG125",
      "银钢YG150",
      "银钢三轮摩托"
    ]
  },
  {
    "id": "motorcycle-16",
    "name": "春风",
    "models": [
      "春风150NK",
      "春风250NK",
      "春风400NK",
      "春风650NK",
      "春风ST狒狒",
      "春风狒狒",
      "春风250SR",
      "春风450SR"
    ],
    "aliases": [
      "CFMOTO"
    ]
  },
  {
    "id": "motorcycle-17",
    "name": "奔达",
    "models": [
      "奔达金吉拉300",
      "奔达灰石300",
      "奔达拿破仑450",
      "奔达燎700",
      "奔达唐刀700"
    ]
  },
  {
    "id": "motorcycle-18",
    "name": "升仕",
    "models": [
      "升仕ZT125",
      "升仕ZT150",
      "升仕ZT250",
      "升仕310R",
      "升仕310X",
      "升仕350D",
      "升仕368G"
    ]
  },
  {
    "id": "motorcycle-19",
    "name": "三阳",
    "models": [
      "三阳飞度",
      "三阳巡弋",
      "三阳Joymax",
      "三阳FNX",
      "三阳DRG",
      "三阳哈士奇"
    ],
    "aliases": [
      "SYM"
    ]
  },
  {
    "id": "motorcycle-20",
    "name": "光阳",
    "models": [
      "光阳豪迈125",
      "光阳弯道情人",
      "光阳赛艇250",
      "光阳赛艇300",
      "光阳People",
      "光阳Any Like"
    ],
    "aliases": [
      "KYMCO"
    ]
  },
  {
    "id": "motorcycle-21",
    "name": "标致摩托",
    "models": [
      "标致姜戈",
      "标致Speedfight",
      "标致Citystar",
      "标致SF4",
      "标致Metropolis"
    ],
    "aliases": [
      "Peugeot"
    ]
  },
  {
    "id": "motorcycle-22",
    "name": "台铃",
    "models": [
      "台铃电摩",
      "台铃电动摩托",
      "台铃标兵",
      "台铃豹子",
      "台铃赤兔",
      "台铃领跑"
    ]
  },
  {
    "id": "motorcycle-23",
    "name": "雅迪",
    "models": [
      "雅迪电摩",
      "雅迪冠能",
      "雅迪欧逸",
      "雅迪莱客",
      "雅迪G5",
      "雅迪DE系列"
    ]
  },
  {
    "id": "motorcycle-24",
    "name": "爱玛",
    "models": [
      "爱玛电摩",
      "爱玛劲远",
      "爱玛小蜜豆",
      "爱玛蛋蛋",
      "爱玛极客",
      "爱玛露娜"
    ]
  },
  {
    "id": "motorcycle-25",
    "name": "新日",
    "models": [
      "新日电摩",
      "新日MIKU",
      "新日XC系列",
      "新日风雅",
      "新日小龟王"
    ]
  }
];

prependSupplementalModels(carCatalog, {
  丰田: ["凯美瑞", "卡罗拉", "花冠", "皇冠", "锐志", "威驰", "雅力士", "普拉多", "兰德酷路泽", "RAV4荣放", "佳美"],
  本田: ["雅阁", "飞度", "思域", "锋范", "奥德赛", "思迪", "杰德", "歌诗图", "本田CR-V", "本田XR-V"],
  日产: ["轩逸", "骐达", "颐达", "阳光", "天籁", "骊威", "逍客", "奇骏", "蓝鸟", "骏逸"],
  别克: ["凯越", "英朗", "君威", "君越", "GL8", "赛欧", "荣御", "昂科拉", "昂科威"],
  雪佛兰: ["科鲁兹", "赛欧", "乐风", "景程", "迈锐宝", "爱唯欧", "科帕奇", "乐骋"],
  福特: ["福克斯", "嘉年华", "蒙迪欧", "翼虎", "翼搏", "致胜", "麦柯斯", "经典全顺"],
  现代: ["伊兰特", "悦动", "朗动", "瑞纳", "索纳塔", "途胜", "ix35", "名驭", "雅绅特"],
  起亚: ["赛拉图", "福瑞迪", "K2", "K3", "K5", "狮跑", "智跑", "千里马", "锐欧"],
  马自达: ["马自达3", "马自达6", "马自达2", "睿翼", "普力马", "福美来", "海马骑士"],
  铃木: ["奥拓", "北斗星", "雨燕", "羚羊", "天语SX4", "利亚纳", "浪迪", "吉姆尼"],
  奇瑞: ["奇瑞QQ", "奇瑞QQ3", "风云", "风云2", "旗云", "旗云2", "瑞虎", "东方之子", "A3", "E5"],
  吉利汽车: ["自由舰", "金刚", "远景", "帝豪", "美日", "豪情", "熊猫", "英伦SC7", "全球鹰GX2"],
  比亚迪: ["比亚迪F0", "比亚迪F3", "比亚迪F3R", "比亚迪F6", "比亚迪G3", "比亚迪L3", "速锐", "思锐"],
  长安: ["奔奔", "奔奔MINI", "悦翔", "悦翔V3", "悦翔V5", "志翔", "CX20", "CX30", "逸动"],
  一汽: ["夏利", "夏利N3", "夏利N5", "威志", "威乐", "威姿", "森雅M80", "森雅S80"],
  雪铁龙: ["富康", "爱丽舍", "世嘉", "凯旋", "毕加索", "赛纳", "C2", "C4L", "C5"],
  标致: ["标致206", "标致207", "标致307", "标致308", "标致408", "标致508"],
  海马: ["福美来", "海福星", "普力马", "丘比特", "海马3", "海马骑士"],
  东南: ["菱帅", "菱悦", "V3菱悦", "得利卡", "富利卡", "希旺"],
  中华: ["中华骏捷", "中华尊驰", "中华酷宝", "中华H230", "中华H330", "中华V5"],
  力帆: ["力帆320", "力帆520", "力帆620", "力帆720", "力帆X60"],
});

const vehicleCatalogByType: Record<VehicleType, VehicleBrandCatalogItem[]> = {
  car: carCatalog,
  truck: truckCatalog,
  motorcycle: motorcycleCatalog,
};

export function getVehicleBrandCatalog(vehicleType: VehicleType) {
  return vehicleCatalogByType[vehicleType];
}

export function getVehicleCatalogStats(vehicleType: VehicleType) {
  const catalog = getVehicleBrandCatalog(vehicleType);
  return {
    brandCount: catalog.length,
    modelCount: catalog.reduce((total, brand) => total + brand.models.length, 0),
  };
}

export function buildBrandModelValue(brandName: string, modelName: string) {
  const trimmedBrand = brandName.trim();
  const trimmedModel = trimDuplicatedBrandPrefix(trimmedBrand, modelName.trim());
  return `${trimmedBrand} ${trimmedModel}`.trim();
}

export function searchVehicleModels(vehicleType: VehicleType, keyword: string, limit = 36) {
  const normalizedKeyword = normalizeVehicleKeyword(keyword);
  if (!normalizedKeyword) {
    return [];
  }

  return getVehicleBrandCatalog(vehicleType)
    .flatMap(brand =>
      brand.models.map(modelName => {
        const suggestion = {
          brandId: brand.id,
          brandName: brand.name,
          modelName,
          value: buildBrandModelValue(brand.name, modelName),
        };
        return {
          suggestion,
          score: getSuggestionScore(brand, modelName, suggestion.value, normalizedKeyword),
        };
      }),
    )
    .filter(item => item.score < 100)
    .sort((left, right) => left.score - right.score || left.suggestion.value.length - right.suggestion.value.length)
    .slice(0, limit)
    .map(item => item.suggestion);
}

export function findInitialVehicleBrandId(value: string, vehicleType: VehicleType) {
  const normalizedValue = normalizeVehicleKeyword(value);
  if (!normalizedValue) {
    return getVehicleBrandCatalog(vehicleType)[0]?.id ?? "";
  }

  const directBrand = getVehicleBrandCatalog(vehicleType).find(brand =>
    getBrandSearchTokens(brand).some(token => normalizedValue.startsWith(token) || token.startsWith(normalizedValue)),
  );
  if (directBrand) {
    return directBrand.id;
  }

  const firstSuggestion = searchVehicleModels(vehicleType, value, 1)[0];
  return firstSuggestion?.brandId ?? getVehicleBrandCatalog(vehicleType)[0]?.id ?? "";
}

function getSuggestionScore(
  brand: VehicleBrandCatalogItem,
  modelName: string,
  value: string,
  normalizedKeyword: string,
) {
  const normalizedBrand = normalizeVehicleKeyword(brand.name);
  const normalizedModel = normalizeVehicleKeyword(modelName);
  const normalizedValue = normalizeVehicleKeyword(value);
  const brandTokens = getBrandSearchTokens(brand);

  if (normalizedValue === normalizedKeyword || normalizedModel === normalizedKeyword) {
    return 0;
  }
  if (normalizedValue.startsWith(normalizedKeyword)) {
    return 1;
  }
  if (normalizedKeyword.startsWith(normalizedBrand) && normalizedValue.includes(normalizedKeyword)) {
    return 2;
  }
  if (normalizedModel.startsWith(normalizedKeyword)) {
    return 3;
  }
  if (normalizedValue.includes(normalizedKeyword)) {
    return 4;
  }
  if (brandTokens.some(token => token.includes(normalizedKeyword) || normalizedKeyword.includes(token))) {
    return 8;
  }
  return 100;
}

function getBrandSearchTokens(brand: VehicleBrandCatalogItem) {
  return [brand.name, ...(brand.aliases ?? [])].map(normalizeVehicleKeyword).filter(Boolean);
}

function prependSupplementalModels(catalog: VehicleBrandCatalogItem[], supplementalModels: Record<string, string[]>) {
  for (const [brandName, models] of Object.entries(supplementalModels)) {
    const brand = catalog.find(item => item.name === brandName);
    if (!brand) {
      continue;
    }

    const existingModels = new Set(brand.models.map(normalizeVehicleKeyword));
    brand.models = [
      ...models.filter(modelName => !existingModels.has(normalizeVehicleKeyword(modelName))),
      ...brand.models,
    ];
  }
}

function trimDuplicatedBrandPrefix(brandName: string, modelName: string) {
  const normalizedBrand = normalizeVehicleKeyword(brandName);
  const normalizedModel = normalizeVehicleKeyword(modelName);
  if (!normalizedBrand || !normalizedModel.startsWith(normalizedBrand)) {
    return modelName;
  }

  const strippedModel = modelName.slice(brandName.length).trim();
  return strippedModel || modelName;
}

function normalizeVehicleKeyword(value: string) {
  return value
    .trim()
    .toLocaleLowerCase()
    .replace(/[\s·・,，.。/\\\-—_()（）\[\]【】]+/g, "");
}
